[
  {
    "name": "Algerian Kefta (Meatballs)",
    "instructions": "Combine ground beef with 1/2 of the minced garlic and 1 tablespoon chopped onion in a large bowl. Mix with your hands until fully incorporated. Shape meat mixture into 1 1/2-inch oblong patties; you should have 12 to 14 meatballs.\r\n\r\nHeat a large skillet over medium-high heat. Brown patties in batches in the hot skillet until crispy on both sides and no longer pink in the center, about 10 minutes. Set meatballs aside in a rimmed serving dish.\r\n\r\nReduce heat to medium and stir remaining chopped onion into drippings in the skillet. Season with salt and pepper. Cook, stirring constantly, until onion has softened and turned translucent, about 5 minutes. Stir in remaining garlic and cook for 30 seconds. Stir in Roma tomatoes, dried parsley, and ras el hanout. Pour in water. Cook until tomatoes are soft, about 5 minutes.\r\n\r\nPour tomato sauce over meatballs to serve.",
    "description": "Beef · Algerian",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/8rfd4q1764112993.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Ground Beef",
        "quantity": "1 lb"
      },
      {
        "item": "Garlic",
        "quantity": "4 Cloves Crushed"
      },
      {
        "item": "Onion",
        "quantity": "1/2 cup"
      },
      {
        "item": "Salt",
        "quantity": "To taste"
      },
      {
        "item": "Pepper",
        "quantity": "To taste"
      },
      {
        "item": "Plum Tomatoes",
        "quantity": "3"
      },
      {
        "item": "Parsley",
        "quantity": "1 tsp"
      },
      {
        "item": "Water",
        "quantity": "1/2 cup"
      }
    ]
  },
  {
    "name": "Arepa Pabellón",
    "instructions": "Prepare the meat in a skillet and add salt and pepper to taste, heat the beans over medium heat in a pan, fry or grill the ripe plantains as indicated on its package and cut the tomato into small cubes. Reserve these ingredients until filling. \r\nPreheat the grill or pan and grill the arepa, putting it once on each side until they are golden brown. \r\nWith the help of a knife, open it by the edge through the middle, creating a space to fill it with the ripe plantain, the beans, meat and chopped tomato. \r\nServe with a little pico de gallo or guacamole dip sauce. ",
    "description": "Beef · Venezulan",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/13fg4j1764441982.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Corn Arepa Filled With Mozarella Cheese",
        "quantity": "2"
      },
      {
        "item": "Fried Ripe Bananas",
        "quantity": "1"
      },
      {
        "item": "Black Beans",
        "quantity": "1 Can"
      },
      {
        "item": "Pico De Gallo Sauce",
        "quantity": "1"
      },
      {
        "item": "Shredded Meat",
        "quantity": "2kg"
      },
      {
        "item": "Tomato",
        "quantity": "1 chopped"
      },
      {
        "item": "Salt",
        "quantity": "Pinch"
      },
      {
        "item": "Pepper",
        "quantity": "Pinch"
      }
    ]
  },
  {
    "name": "Arepa pelua",
    "instructions": "Cook the meat: Place the flank steak in a pot with broth or water and salt. Cook over low heat for about 2 hours, until tender and easy to shred.\r\nShred the meat: Once cooked, drain and shred the meat using two forks.\r\nPrepare the vegetables: Sauté chopped onion, bell pepper, and garlic in a little oil. Add cumin, oregano, paprika, and salt. Stir in the meat and cook for a few minutes until the flavors are well combined.\r\nMake the dough: In a bowl, mix the cornmeal with warm water and salt until a soft dough forms. Let it rest for 5 minutes.\r\nForm the arepas: Divide the dough into 6 portions, shape into balls, and flatten into thick discs.\r\nCook: Cook the arepas on a griddle or skillet over medium heat for 2–3 minutes on each side until golden. You can then bake them for a few minutes if you prefer them crispier.\r\nFill: Slice the arepas open on one side, fill with the hot shredded beef, and top with grated cheese.",
    "description": "Beef · Venezulan",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/jgl9qq1764437635.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Beef",
        "quantity": "500g"
      },
      {
        "item": "Onion",
        "quantity": "1"
      },
      {
        "item": "Red Pepper",
        "quantity": "1"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "item": "Cumin",
        "quantity": "1 tsp"
      },
      {
        "item": "Oregano",
        "quantity": "1 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "1 tsp"
      },
      {
        "item": "Beef Stock",
        "quantity": "1 L"
      },
      {
        "item": "Water",
        "quantity": "2 1/2 cups"
      },
      {
        "item": "Salt",
        "quantity": "Pinch"
      },
      {
        "item": "Cheese",
        "quantity": "200g"
      },
      {
        "item": "Extra Virgin Olive Oil",
        "quantity": "Pinch"
      }
    ]
  },
  {
    "name": "Asado",
    "instructions": "Prepare the Fire: Start a wood fire in your grill and let it burn down to coals.\r\nSeason the Meat: Generously salt the beef cuts.\r\nGrill the Meat: Place the beef on the grill, starting with the thickest cuts farthest from the coals. Add chorizo and morcilla after the beef has been cooking for a while.\r\nCook to Perfection: Cook the meat, turning occasionally, until it reaches your desired doneness. Typically, ribs may take up to 2 hours; thinner cuts will cook faster.\r\nRest and Serve: Let the meat rest for about 10 minutes before slicing. Serve with chimichurri sauce and grilled vegetables.\r\nPro Tips:\r\n\r\nUse a mix of wood and charcoal for a consistent heat source. Wood adds flavor, while charcoal maintains temperature.\r\nSeason the meat just before grilling to ensure it retains its moisture and flavor.\r\nServing Suggestions:\r\n\r\nServe with a side of chimichurri sauce, a fresh tomato salad, and crusty bread. Pair with a robust Malbec wine to complement the rich flavors of the meat.",
    "description": "Beef · Argentinian",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/kgfh3q1763075438.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Mixed Beef Cuts",
        "quantity": "2kg"
      },
      {
        "item": "Chorizo",
        "quantity": "4"
      },
      {
        "item": "Morcilla",
        "quantity": "2"
      },
      {
        "item": "Salt",
        "quantity": "To taste"
      }
    ]
  },
  {
    "name": "Aussie Burgers",
    "instructions": "step 1\r\nMake the burgers: Tip the meat into a bowl and sprinkle over 1 tsp salt and a good grinding of black pepper.Work with wet hands to mix in the seasoning. Divide into four with your hands and shape into burgers. (It can be frozen at this stage.)\r\n\r\nstep 2\r\nSort out your ingredients: Slice the beetroot and split the naan breads.\r\n\r\nstep 3\r\nToast the naans: Heat a griddle pan or barbecue. Griddle the naans on both sides until lightly toasted and set aside. Add the burgers to the grill or barbecue and cook for 2-3 minutes, then turn and cook the other side for a further 2-3 minutes.\r\n\r\nstep 4\r\nAssemble the dish: Set half a toasted naan on each serving plate and put a pile of rocket on each. Top with a burger, then a few slices of beetroot and a dollop of soured cream. Sprinkle with salt and freshly ground black pepper and serve immediately with a big green salad and chips. A glass of red wine wouldn’t go amiss, either.",
    "description": "Beef · Australian",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/44bzep1761848278.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Lean Minced Steak",
        "quantity": "500g"
      },
      {
        "item": "Cooked Beetroot",
        "quantity": "100g"
      },
      {
        "item": "Naan Bread",
        "quantity": "2 small"
      },
      {
        "item": "Rocket",
        "quantity": "50g"
      },
      {
        "item": "Soured cream and chive dip",
        "quantity": "4 tablespoons"
      }
    ]
  },
  {
    "name": "Beef and Broccoli Stir-Fry",
    "instructions": "Marinate the beef:\r\nStir together the beef marinade ingredients (1 teaspoon soy sauce, 1 teaspoon Chinese rice wine, 1/2 teaspoon cornstarch, 1/8 teaspoon black pepper) in a medium bowl.\r\n\r\nAdd the beef slices and stir until coated. Let stand for 10 minutes.\r\n\r\nPrepare the sauce:\r\nStir together the sauce ingredients (2 tablespoons oyster sauce, 1 teaspoon Chinese rice wine, 1 teaspoon soy sauce, 1/4 cup chicken broth) in a small bowl. Set aside.\r\n\r\nBlanch or steam the broccoli:\r\nBring a pot of water to a boil. Add the broccoli and cook until crisp-tender, about 2 minutes. Drain thoroughly.\r\n\r\nStir-fry the beef:\r\nHeat a large frying pan or wok over high heat until a bead of water sizzles and instantly evaporates upon contact. Add the cooking oil and swirl to coat.\r\n\r\nAdd the beef and immediately spread it out all over the surface of the wok or pan in a single layer (preferably not touching).\r\n\r\nLet the beef fry undisturbed for 1 minute. Flip the beef slices over, add the garlic to the pan, and fry for an additional 30 seconds to 1 minute until no longer pink.\r\n\r\nAdd the sauce, cornstarch, and broccoli:\r\nPour in the sauce and the cornstarch slurry (1 teaspoon cornstarch dissolved in 1 tablespoon of water). Stir until the sauce boils and thickens, about 30 seconds. Stir in the broccoli.\r\n\r\nServe immediately, with steamed rice or on its own.",
    "description": "Beef · Chinese",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/m0p0j81765568742.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Soy Sauce",
        "quantity": "1 tsp"
      },
      {
        "item": "Dry sherry",
        "quantity": "1 tsp"
      },
      {
        "item": "Cornstarch",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Black Pepper",
        "quantity": "1/8 teaspoon"
      },
      {
        "item": "Sirloin steak",
        "quantity": "1 lb"
      },
      {
        "item": "Oyster Sauce",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Dry sherry",
        "quantity": "1 tsp"
      },
      {
        "item": "Soy Sauce",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Chicken Stock",
        "quantity": "1/4 cup"
      },
      {
        "item": "Broccoli",
        "quantity": "1 lb"
      },
      {
        "item": "High Heat Cooking Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "item": "Cornstarch",
        "quantity": "1 tsp"
      },
      {
        "item": "Water",
        "quantity": "1 tablespoon"
      }
    ]
  },
  {
    "name": "Beef and Mustard Pie",
    "instructions": "Preheat the oven to 150C/300F/Gas 2.\r\nToss the beef and flour together in a bowl with some salt and black pepper.\r\nHeat a large casserole until hot, add half of the rapeseed oil and enough of the beef to just cover the bottom of the casserole.\r\nFry until browned on each side, then remove and set aside. Repeat with the remaining oil and beef.\r\nReturn the beef to the pan, add the wine and cook until the volume of liquid has reduced by half, then add the stock, onion, carrots, thyme and mustard, and season well with salt and pepper.\r\nCover with a lid and place in the oven for two hours.\r\nRemove from the oven, check the seasoning and set aside to cool. Remove the thyme.\r\nWhen the beef is cool and you're ready to assemble the pie, preheat the oven to 200C/400F/Gas 6.\r\nTransfer the beef to a pie dish, brush the rim with the beaten egg yolks and lay the pastry over the top. Brush the top of the pastry with more beaten egg.\r\nTrim the pastry so there is just enough excess to crimp the edges, then place in the oven and bake for 30 minutes, or until the pastry is golden-brown and cooked through.\r\nFor the green beans, bring a saucepan of salted water to the boil, add the beans and cook for 4-5 minutes, or until just tender.\r\nDrain and toss with the butter, then season with black pepper.\r\nTo serve, place a large spoonful of pie onto each plate with some green beans alongside.",
    "description": "Beef · British",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/sytuqu1511553755.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Beef",
        "quantity": "1kg"
      },
      {
        "item": "Plain Flour",
        "quantity": "2 tbs"
      },
      {
        "item": "Rapeseed Oil",
        "quantity": "2 tbs"
      },
      {
        "item": "Red Wine",
        "quantity": "200ml"
      },
      {
        "item": "Beef Stock",
        "quantity": "400ml"
      },
      {
        "item": "Onion",
        "quantity": "1 finely sliced"
      },
      {
        "item": "Carrots",
        "quantity": "2 chopped"
      },
      {
        "item": "Thyme",
        "quantity": "3 sprigs"
      },
      {
        "item": "Mustard",
        "quantity": "2 tbs"
      },
      {
        "item": "Egg Yolks",
        "quantity": "2 free-range"
      },
      {
        "item": "Puff Pastry",
        "quantity": "400g"
      },
      {
        "item": "Green Beans",
        "quantity": "300g"
      },
      {
        "item": "Butter",
        "quantity": "25g"
      },
      {
        "item": "Salt",
        "quantity": "pinch"
      },
      {
        "item": "Pepper",
        "quantity": "pinch"
      }
    ]
  },
  {
    "name": "Beef and Oyster pie",
    "instructions": "Season the beef cubes with salt and black pepper. Heat a tablespoon of oil in the frying pan and fry the meat over a high heat. Do this in three batches so that you don’t overcrowd the pan, transferring the meat to a large flameproof casserole dish once it is browned all over. Add extra oil if the pan seems dry.\r\nIn the same pan, add another tablespoon of oil and cook the shallots for 4-5 minutes, then add the garlic and fry for 30 seconds. Add the bacon and fry until slightly browned. Transfer the onion and bacon mixture to the casserole dish and add the herbs.\r\nPreheat the oven to 180C/350F/Gas 4.\r\nPour the stout into the frying pan and bring to the boil, stirring to lift any stuck-on browned bits from the bottom of the pan. Pour the stout over the beef in the casserole dish and add the stock. Cover the casserole and place it in the oven for 1½-2 hours, or until the beef is tender and the sauce is reduced.\r\nSkim off any surface fat, taste and add salt and pepper if necessary, then stir in the cornflour paste. Put the casserole dish on the hob – don’t forget that it will be hot – and simmer for 1-2 minutes, stirring, until thickened. Leave to cool.\r\nIncrease the oven to 200C/400F/Gas 6. To make the pastry, put the flour and salt in a very large bowl. Grate the butter and stir it into the flour in three batches. Gradually add 325ml/11fl oz cold water – you may not need it all – and stir with a round-bladed knife until the mixture just comes together. Knead the pastry lightly into a ball on a lightly floured surface and set aside 250g/9oz for the pie lid.\r\nRoll the rest of the pastry out until about 2cm/¾in larger than the dish you’re using. Line the dish with the pastry then pile in the filling, tucking the oysters in as well. Brush the edge of the pastry with beaten egg.\r\nRoll the remaining pastry until slightly larger than your dish and gently lift over the filling, pressing the edges firmly to seal, then trim with a sharp knife. Brush with beaten egg to glaze. Put the dish on a baking tray and bake for 25-30 minutes, or until the pastry is golden-brown and the filling is bubbling.",
    "description": "Beef · British",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/wrssvt1511556563.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Beef",
        "quantity": "900g"
      },
      {
        "item": "Olive Oil",
        "quantity": "3 tbs"
      },
      {
        "item": "Shallots",
        "quantity": "3"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "item": "Bacon",
        "quantity": "125g"
      },
      {
        "item": "Thyme",
        "quantity": "1 tbs chopped"
      },
      {
        "item": "Bay Leaf",
        "quantity": "2"
      },
      {
        "item": "Stout",
        "quantity": "330ml"
      },
      {
        "item": "Beef Stock",
        "quantity": "400ml"
      },
      {
        "item": "Corn Flour",
        "quantity": "2 tbs"
      },
      {
        "item": "Oysters",
        "quantity": "8"
      },
      {
        "item": "Plain Flour",
        "quantity": "400g"
      },
      {
        "item": "Salt",
        "quantity": "pinch"
      },
      {
        "item": "Butter",
        "quantity": "250g"
      },
      {
        "item": "Eggs",
        "quantity": "To Glaze"
      }
    ]
  },
  {
    "name": "Beef Asado",
    "instructions": "0.\tCombine beef, crushed peppercorn, soy sauce, vinegar, dried bay leaves, lemon, and tomato sauce. Mix well. Marinate beef for at least 30 minutes.\r\n1.\tPut the marinated beef in a cooking pot along with remaining marinade. Add water. Let boil.\r\n2.\tAdd Knorr Beef Cube. Stir. Cover the pot and cook for 40 minutes in low heat.\r\n3.\tTurn the beef over. Add tomato paste. Continue cooking until beef tenderizes. Set aside.\r\n4.\tHeat oil in a pan. Fry the potato until it browns. Turn over and continue frying the opposite side. Remove from the pan and place on a clean plate. Do the same with the carrots.\r\n5.\tSave 3 tablespoons of cooking oil from the pan where the potato was fried. Saute onion and garlic until onion softens.\r\n6.\tPour-in the sauce from the beef stew. Let boil. Add the beef. Cook for 2 minutes.\r\n7.\tAdd butter and let it melt. Continue cooking until the sauce reduces to half.",
    "description": "Beef · Filipino",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/pkopc31683207947.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Beef",
        "quantity": "1.5kg"
      },
      {
        "item": "Beef Stock Concentrate",
        "quantity": "1"
      },
      {
        "item": "Tomato Puree",
        "quantity": "8 ounces"
      },
      {
        "item": "Water",
        "quantity": "3 cups"
      },
      {
        "item": "Soy Sauce",
        "quantity": "6 tablespoons"
      },
      {
        "item": "White Wine Vinegar",
        "quantity": "1 tbs"
      },
      {
        "item": "Pepper",
        "quantity": "2 tbs"
      },
      {
        "item": "Bay Leaf",
        "quantity": "4"
      },
      {
        "item": "Lemon",
        "quantity": "1/2"
      },
      {
        "item": "Tomato Sauce",
        "quantity": "2 tbs"
      },
      {
        "item": "Butter",
        "quantity": "3 tbs"
      },
      {
        "item": "Olive Oil",
        "quantity": "1/2 cup"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Garlic",
        "quantity": "4 cloves"
      }
    ]
  },
  {
    "name": "Beef Banh Mi Bowls with Sriracha Mayo, Carrot & Pickled Cucumber",
    "instructions": "Add'l ingredients: mayonnaise, siracha\r\n\r\n1\r\n\r\nPlace rice in a fine-mesh sieve and rinse until water runs clear. Add to a small pot with 1 cup water (2 cups for 4 servings) and a pinch of salt. Bring to a boil, then cover and reduce heat to low. Cook until rice is tender, 15 minutes. Keep covered off heat for at least 10 minutes or until ready to serve.\r\n\r\n2\r\n\r\nMeanwhile, wash and dry all produce. Peel and finely chop garlic. Zest and quarter lime (for 4 servings, zest 1 lime and quarter both). Trim and halve cucumber lengthwise; thinly slice crosswise into half-moons. Halve, peel, and medium dice onion. Trim, peel, and grate carrot.\r\n\r\n3\r\n\r\nIn a medium bowl, combine cucumber, juice from half the lime, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. In a small bowl, combine mayonnaise, a pinch of garlic, a squeeze of lime juice, and as much sriracha as you’d like. Season with salt and pepper.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add onion and cook, stirring, until softened, 4-5 minutes. Add beef, remaining garlic, and 2 tsp sugar (4 tsp for 4 servings). Cook, breaking up meat into pieces, until beef is browned and cooked through, 4-5 minutes. Stir in soy sauce. Turn off heat; taste and season with salt and pepper.\r\n\r\n5\r\n\r\nFluff rice with a fork; stir in lime zest and 1 TBSP butter. Divide rice between bowls. Arrange beef, grated carrot, and pickled cucumber on top. Top with a squeeze of lime juice. Drizzle with sriracha mayo.",
    "description": "Beef · Vietnamese",
    "category": "Beef",
    "image_url": "https://www.themealdb.com/images/media/meals/z0ageb1583189517.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Rice",
        "quantity": "White"
      },
      {
        "item": "Onion",
        "quantity": "1"
      },
      {
        "item": "Lime",
        "quantity": "1"
      },
      {
        "item": "Garlic Clove",
        "quantity": "3"
      },
      {
        "item": "Cucumber",
        "quantity": "1"
      },
      {
        "item": "Carrots",
        "quantity": "3 oz"
      },
      {
        "item": "Ground Beef",
        "quantity": "1 lb"
      },
      {
        "item": "Soy Sauce",
        "quantity": "2 oz"
      }
    ]
  },
  {
    "name": "15-minute chicken & halloumi burgers",
    "instructions": "STEP 1\r\n\r\nPut the chicken breasts between two pieces of baking parchment and use a rolling pin to gently bash them until they are approximately 1cm thick. Cut each chicken breast into two even pieces.\r\n\r\nSTEP 2\r\n\r\nIf you're using a frying pan, heat two frying pans over medium-high heat, with one of them containing oil. Fry the chicken in the oiled pan for 3-4 mins on each side until they are cooked through. Season the chicken, reduce the heat, drizzle in the chilli sauce and half of the lemon juice, and cook for an additional 1-2 mins until the sauce is reduced. Remove the chicken from the heat.\r\n\r\nSTEP 3\r\n\r\nIf you're using an air-fryer, preheat it to 180C for 4 mins. Add the chicken to the air-fryer and cook for 12 mins. Drizzle over the chilli sauce and half the lemon juice and cook for an additional 1-2 mins until the chicken is cooked through and the sauce is reduced. Remove the chicken and keep it warm.\r\nSTEP 4\r\n\r\nWhile the chicken is cooking, toast the buns in the dry frying pan for 30 seconds. Transfer them to a plate. If you're using an air fryer, put the buns in the air fryer for 1-2 mins until they are warm. Increase the air fryer temperature to 200C. Add the halloumi to the air fryer basket and cook for 10 mins, turning halfway through, until it's golden. Toss the cabbage with the mayo and the remaining lemon juice.\r\n\r\nSTEP 5\r\n\r\nSpoon the hummus (or dip of your choice) into the toasted buns, then top with the rocket, chilli chicken, halloumi, and peppers. Drizzle with a little more chilli sauce, spoon over the cabbage, season with black pepper, and top with the bun lids. Serve with any extra cabbage on the side or a green salad.",
    "description": "Chicken · American",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/vdwloy1713225718.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chicken Breasts",
        "quantity": "2"
      },
      {
        "item": "Oil",
        "quantity": "1 tbsp"
      },
      {
        "item": "Hotsauce",
        "quantity": "4 tbsp"
      },
      {
        "item": "Lemon Juice",
        "quantity": "½"
      },
      {
        "item": "Buns",
        "quantity": "2"
      },
      {
        "item": "Cheese",
        "quantity": "250g"
      },
      {
        "item": "Cabbage",
        "quantity": "¼"
      },
      {
        "item": "Mayonnaise",
        "quantity": "2 tbsp"
      },
      {
        "item": "Sour Cream",
        "quantity": "4 tbsp"
      },
      {
        "item": "Lettuce",
        "quantity": "4 leaves"
      },
      {
        "item": "Red Pepper",
        "quantity": "2"
      }
    ]
  },
  {
    "name": "Ayam Percik",
    "instructions": "In a blender, add the ingredients for the spice paste and blend until smooth.\r\nOver medium heat, pour the spice paste in a skillet or pan and fry for 10 minutes until fragrant. Add water or oil 1 tablespoon at a time if the paste becomes too dry. Don't burn the paste. Lower the fire slightly if needed.\r\nAdd the cloves, cardamom, tamarind pulp, coconut milk, water, sugar and salt. Turn the heat up and bring the mixture to boil. Turn the heat to medium low and simmer for 10 minutes. Stir occasionally. It will reduce slightly. This is the marinade/sauce, so taste and adjust seasoning if necessary. Don't worry if it's slightly bitter. It will go away when roasting.\r\nWhen the marinade/sauce has cooled, pour everything over the chicken and marinate overnight to two days.\r\nPreheat the oven to 425 F.\r\nRemove the chicken from the marinade. Spoon the marinade onto a greased (or aluminum lined) baking sheet. Lay the chicken on top of the sauce (make sure the chicken covers the sauce and the sauce isn't exposed or it'll burn) and spread the remaining marinade on the chicken. Roast for 35-45 minutes or until internal temp of the thickest part of chicken is at least 175 F.\r\nLet chicken rest for 5 minutes. Brush the chicken with some of the oil. Serve chicken with the sauce over steamed rice (or coconut rice).",
    "description": "Chicken · Malaysian",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/020z181619788503.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chicken Thighs",
        "quantity": "6"
      },
      {
        "item": "Challots",
        "quantity": "16"
      },
      {
        "item": "Ginger",
        "quantity": "1 1/2"
      },
      {
        "item": "Garlic Clove",
        "quantity": "6"
      },
      {
        "item": "Cayenne Pepper",
        "quantity": "8"
      },
      {
        "item": "Turmeric",
        "quantity": "2 tbs"
      },
      {
        "item": "Cumin",
        "quantity": "1 1/2"
      },
      {
        "item": "Coriander",
        "quantity": "1 1/2"
      },
      {
        "item": "Fennel",
        "quantity": "1 1/2"
      },
      {
        "item": "Tamarind Paste",
        "quantity": "2 tbs"
      },
      {
        "item": "Coconut Milk",
        "quantity": "1 can"
      },
      {
        "item": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "item": "Water",
        "quantity": "1 cup"
      }
    ]
  },
  {
    "name": "Brown Stew Chicken",
    "instructions": "Squeeze lime over chicken and rub well. Drain off excess lime juice.\r\nCombine tomato, scallion, onion, garlic, pepper, thyme, pimento and soy sauce in a large bowl with the chicken pieces. Cover and marinate at least one hour.\r\nHeat oil in a dutch pot or large saucepan. Shake off the seasonings as you remove each piece of chicken from the marinade. Reserve the marinade for sauce.\r\nLightly brown the chicken a few pieces at a time in very hot oil. Place browned chicken pieces on a plate to rest while you brown the remaining pieces.\r\nDrain off excess oil and return the chicken to the pan. Pour the marinade over the chicken and add the carrots. Stir and cook over medium heat for 10 minutes.\r\nMix flour and coconut milk and add to stew, stirring constantly. Turn heat down to minimum and cook another 20 minutes or until tender.",
    "description": "Chicken · Jamaican",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/sypxpx1515365095.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chicken",
        "quantity": "1 whole"
      },
      {
        "item": "Tomato",
        "quantity": "1 chopped"
      },
      {
        "item": "Onions",
        "quantity": "2 chopped"
      },
      {
        "item": "Garlic Clove",
        "quantity": "2 chopped"
      },
      {
        "item": "Red Pepper",
        "quantity": "1 chopped"
      },
      {
        "item": "Carrots",
        "quantity": "1 chopped"
      },
      {
        "item": "Lime",
        "quantity": "1"
      },
      {
        "item": "Thyme",
        "quantity": "2 tsp"
      },
      {
        "item": "Allspice",
        "quantity": "1 tsp"
      },
      {
        "item": "Soy Sauce",
        "quantity": "2 tbs"
      },
      {
        "item": "Cornstarch",
        "quantity": "2 tsp"
      },
      {
        "item": "Coconut Milk",
        "quantity": "2 cups"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "1 tbs"
      }
    ]
  },
  {
    "name": "Chick-Fil-A Sandwich",
    "instructions": "Wrap the chicken loosely between plastic wrap and pound gently with the flat side of a meat tenderizer until about 1/2 inch thick all around.\r\nCut into two pieces, as even as possible.\r\nMarinate in the pickle juice for 30 minutes to one hour (add a teaspoon of Tabasco sauce now for a spicy sandwich).\r\nBeat the egg with the milk in a bowl.\r\nCombine the flour, sugar, and spices in another bowl.\r\nDip the chicken pieces each into the egg on both sides, then coat in flour on both sides.\r\nHeat the oil in a skillet (1/2 inch deep) to about 345-350.\r\nFry each cutlet for 2 minutes on each side, or until golden and cooked through.\r\nBlot on paper and serve on toasted buns with pickle slices.",
    "description": "Chicken · American",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/sbx7n71587673021.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chicken Breast",
        "quantity": "1"
      },
      {
        "item": "Pickle Juice",
        "quantity": "1/4 cup"
      },
      {
        "item": "Egg",
        "quantity": "1"
      },
      {
        "item": "Milk",
        "quantity": "1/4 cup"
      },
      {
        "item": "Flour",
        "quantity": "1/2 cup"
      },
      {
        "item": "Icing Sugar",
        "quantity": "1 tbs"
      },
      {
        "item": "Paprika",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Salt",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Black Pepper",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Garlic Powder",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Celery Salt",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Cayenne Pepper",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 cup"
      },
      {
        "item": "Sesame Seed Burger Buns",
        "quantity": "1"
      }
    ]
  },
  {
    "name": "Chicken & chorizo rice pot",
    "instructions": "step 1\r\nHeat the oil in a large flameproof casserole dish and brown the chicken pieces on all sides – you may have to do this in batches. Remove from the dish and put to one side.\r\n\r\nstep 2\r\nLower the heat, add the onion and pepper, and gently cook for 10 mins until softened. Add the garlic and chorizo, and cook for a further 2 mins until the chorizo has released some of its oils into the dish. Stir in the tomato purée and cook for 1 min more.\r\n\r\nstep 3\r\nReturn the chicken pieces to the dish along with the thyme, white wine and stock. Bring the liquid to a boil, cover the dish with a tight-fitting lid and lower the heat. Cook for 30 mins.\r\n\r\nstep 4\r\nTip in the rice and stir everything together. Cover, set over a low heat and cook for a further 15 mins, or until the rice is cooked and has absorbed most of the cooking liquid. Remove from the heat and leave the dish to sit for 10 mins to absorb any remaining liquid. Season to taste and scatter with parsley to serve.",
    "description": "Chicken · Spanish",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/fk80jp1763280767.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Oil",
        "quantity": "1 tblsp"
      },
      {
        "item": "Chicken",
        "quantity": "1 whole"
      },
      {
        "item": "Onion",
        "quantity": "1 Large Chopped"
      },
      {
        "item": "Red Pepper",
        "quantity": "1 chopped"
      },
      {
        "item": "Garlic",
        "quantity": "3 Cloves Crushed"
      },
      {
        "item": "Chorizo",
        "quantity": "225g"
      },
      {
        "item": "Tomato Puree",
        "quantity": "1 tblsp"
      },
      {
        "item": "Thyme",
        "quantity": "1 tablespoon chopped"
      },
      {
        "item": "White Wine",
        "quantity": "150ml"
      },
      {
        "item": "Chicken Stock",
        "quantity": "800ml"
      },
      {
        "item": "Rice",
        "quantity": "400g"
      },
      {
        "item": "Parsley",
        "quantity": "2 tbs chopped"
      }
    ]
  },
  {
    "name": "Chicken & mushroom Hotpot",
    "instructions": "Heat oven to 200C/180C fan/gas 6. Put the butter in a medium-size saucepan and place over a medium heat. Add the onion and leave to cook for 5 mins, stirring occasionally. Add the mushrooms to the saucepan with the onions.\r\n\r\nOnce the onion and mushrooms are almost cooked, stir in the flour – this will make a thick paste called a roux. If you are using a stock cube, crumble the cube into the roux now and stir well. Put the roux over a low heat and stir continuously for 2 mins – this will cook the flour and stop the sauce from having a floury taste.\r\n\r\nTake the roux off the heat. Slowly add the fresh stock, if using, or pour in 500ml water if you’ve used a stock cube, stirring all the time. Once all the liquid has been added, season with pepper, a pinch of nutmeg and mustard powder. Put the saucepan back onto a medium heat and slowly bring it to the boil, stirring all the time. Once the sauce has thickened, place on a very low heat. Add the cooked chicken and vegetables to the sauce and stir well. Grease a medium-size ovenproof pie dish with a little butter and pour in the chicken and mushroom filling.\r\n\r\nCarefully lay the potatoes on top of the hot-pot filling, overlapping them slightly, almost like a pie top.\r\n\r\nBrush the potatoes with a little melted butter and cook in the oven for about 35 mins. The hot-pot is ready once the potatoes are cooked and golden brown.",
    "description": "Chicken · British",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/uuuspp1511297945.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Butter",
        "quantity": "50g"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Mushrooms",
        "quantity": "100g"
      },
      {
        "item": "Plain Flour",
        "quantity": "40g"
      },
      {
        "item": "Chicken Stock Cube",
        "quantity": "1"
      },
      {
        "item": "Nutmeg",
        "quantity": "pinch"
      },
      {
        "item": "Mustard Powder",
        "quantity": "pinch"
      },
      {
        "item": "Chicken",
        "quantity": "250g"
      },
      {
        "item": "Sweetcorn",
        "quantity": "2 Handfuls"
      },
      {
        "item": "Potatoes",
        "quantity": "2 large"
      },
      {
        "item": "Butter",
        "quantity": "1 knob"
      }
    ]
  },
  {
    "name": "Chicken Alfredo Primavera",
    "instructions": "Heat 1 tablespoon of butter and 2 tablespoons of olive oil in a large skillet over medium-high heat. Season both sides of each chicken breast with seasoned salt and a pinch of pepper. Add the chicken to the skillet and cook for 5-7 minutes on each side, or until cooked through.  While the chicken is cooking, bring a large pot of water to a boil. Season the boiling water with a few generous pinches of kosher salt. Add the pasta and give it a stir. Cook, stirring occasionally, until al dente, about 12 minutes. Reserve 1/2 cup of  pasta water before draining the pasta.  Remove the chicken from the pan and transfer it to a cutting board; allow it to rest. Turn the heat down to medium and dd the remaining 1 tablespoon of butter and olive oil to the same pan you used to cook the chicken. Add the veggies (minus the garlic) and red pepper flakes to the pan and stir to coat with the oil and butter (refrain from seasoning with salt until the veggies are finished browning). Cook, stirring often, until the veggies are tender, about 5 minutes. Add the garlic and a generous pinch of salt and pepper to the pan and cook for 1 minute.  Deglaze the pan with the white wine. Continue to cook until the wine has reduced by half, about 3 minutes. Stir in the milk, heavy cream, and reserved pasta water. Bring the mixture to a gentle boil and allow to simmer and reduce for 2-3 minutes. Turn off the heat and add the Parmesan cheese and cooked pasta. Season with salt and pepper to taste. Garnish with Parmesan cheese and chopped parsley, if desired. ",
    "description": "Chicken · Italian",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/syqypv1486981727.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Butter",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Olive Oil",
        "quantity": "3 tablespoons"
      },
      {
        "item": "Chicken",
        "quantity": "5 boneless"
      },
      {
        "item": "Salt",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Squash",
        "quantity": "1 cut into 1/2-inch cubes"
      },
      {
        "item": "Broccoli",
        "quantity": "1 Head chopped"
      },
      {
        "item": "mushrooms",
        "quantity": "8-ounce sliced"
      },
      {
        "item": "Pepper",
        "quantity": "1 red"
      },
      {
        "item": "onion",
        "quantity": "1 chopped"
      },
      {
        "item": "garlic",
        "quantity": "3 cloves"
      },
      {
        "item": "red pepper flakes",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "white wine",
        "quantity": "1/2 cup"
      },
      {
        "item": "milk",
        "quantity": "1/2 cup"
      },
      {
        "item": "heavy cream",
        "quantity": "1/2 cup"
      },
      {
        "item": "Parmesan cheese",
        "quantity": "1 cup grated"
      },
      {
        "item": "bowtie pasta",
        "quantity": "16 ounces"
      },
      {
        "item": "Salt",
        "quantity": "pinch"
      },
      {
        "item": "Pepper",
        "quantity": "pinch"
      },
      {
        "item": "Parsley",
        "quantity": "chopped"
      }
    ]
  },
  {
    "name": "Chicken Basquaise",
    "instructions": "Preheat the oven to 180°C/Gas mark 4. Have the chicken joints ready to cook. Heat the butter and 3 tbsp olive oil in a flameproof casserole or large frying pan. Brown the chicken pieces in batches on both sides, seasoning them with salt and pepper as you go. Don't crowd the pan - fry the chicken in small batches, removing the pieces to kitchen paper as they are done.\r\n\r\nAdd a little more olive oil to the casserole and fry the onions over a medium heat for 10 minutes, stirring frequently, until softened but not browned. Add the rest of the oil, then the peppers and cook for another 5 minutes.\r\n\r\nAdd the chorizo, sun-dried tomatoes and garlic and cook for 2-3 minutes. Add the rice, stirring to ensure it is well coated in the oil. Stir in the tomato paste, paprika, bay leaves and chopped thyme. Pour in the stock and wine. When the liquid starts to bubble, turn the heat down to a gentle simmer. Press the rice down into the liquid if it isn't already submerged and place the chicken on top. Add the lemon wedges and olives around the chicken.\r\n\r\nCover and cook in the oven for 50 minutes. The rice should be cooked but still have some bite, and the chicken should have juices that run clear when pierced in the thickest part with a knife. If not, cook for another 5 minutes and check again.",
    "description": "Chicken · French",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/wruvqv1511880994.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chicken",
        "quantity": "1.5kg"
      },
      {
        "item": "Butter",
        "quantity": "25g"
      },
      {
        "item": "Olive Oil",
        "quantity": "6 tblsp"
      },
      {
        "item": "Red Onions",
        "quantity": "2 sliced"
      },
      {
        "item": "Red Pepper",
        "quantity": "3 Large"
      },
      {
        "item": "Chorizo",
        "quantity": "130g"
      },
      {
        "item": "Sun-Dried Tomatoes",
        "quantity": "8"
      },
      {
        "item": "Garlic",
        "quantity": "6 cloves sliced"
      },
      {
        "item": "Basmati Rice",
        "quantity": "300g"
      },
      {
        "item": "Tomato Puree",
        "quantity": "drizzle"
      },
      {
        "item": "Paprika",
        "quantity": "½ tsp"
      },
      {
        "item": "Bay Leaves",
        "quantity": "4"
      },
      {
        "item": "Thyme",
        "quantity": "Handful"
      },
      {
        "item": "Chicken Stock",
        "quantity": "350ml"
      },
      {
        "item": "Dry White Wine",
        "quantity": "180g"
      },
      {
        "item": "Lemons",
        "quantity": "2"
      },
      {
        "item": "Black Olives",
        "quantity": "100g"
      },
      {
        "item": "Salt",
        "quantity": "to serve"
      },
      {
        "item": "Pepper",
        "quantity": "to serve"
      }
    ]
  },
  {
    "name": "Chicken Congee",
    "instructions": "STEP 1 - MARINATING THE CHICKEN\r\nIn a bowl, add chicken, salt, white pepper, ginger juice and then mix it together well.\r\nSet the chicken aside.\r\nSTEP 2 - RINSE THE WHITE RICE\r\nRinse the rice in a metal bowl or pot a couple times and then drain the water.\r\nSTEP 2 - BOILING THE WHITE RICE\r\nNext add 8 cups of water and then set the stove on high heat until it is boiling. Once rice porridge starts to boil, set the stove on low heat and then stir it once every 8-10 minutes for around 20-25 minutes.\r\nAfter 25 minutes, this is optional but you can add a little bit more water to make rice porridge to make it less thick or to your preference.\r\nNext add the marinated chicken to the rice porridge and leave the stove on low heat for another 10 minutes.\r\nAfter an additional 10 minutes add the green onions, sliced ginger, 1 pinch of salt, 1 pinch of white pepper and stir for 10 seconds.\r\nServe the rice porridge in a bowl\r\nOptional: add Coriander on top of the rice porridge.",
    "description": "Chicken · Chinese",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/1529446352.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chicken",
        "quantity": "8 oz"
      },
      {
        "item": "Salt",
        "quantity": "pinch"
      },
      {
        "item": "Pepper",
        "quantity": "pinch"
      },
      {
        "item": "Ginger Cordial",
        "quantity": "1 tsp"
      },
      {
        "item": "Ginger",
        "quantity": "1 tsp"
      },
      {
        "item": "Spring Onions",
        "quantity": "1 tbs"
      },
      {
        "item": "Rice",
        "quantity": "1/2 cup"
      },
      {
        "item": "Water",
        "quantity": "8 cups"
      },
      {
        "item": "Coriander",
        "quantity": "2 oz"
      }
    ]
  },
  {
    "name": "Chicken Couscous",
    "instructions": "Heat the olive oil in a large frying pan and cook the onion for 1-2 mins just until softened. Add the chicken and fry for 7-10 mins until cooked through and the onions have turned golden. Grate over the ginger, stir through the harissa to coat everything and cook for 1 min more.\r\n\r\nTip in the apricots, chickpeas and couscous, then pour over the stock and stir once. Cover with a lid or tightly cover the pan with foil and leave for about 5 mins until the couscous has soaked up all the stock and is soft. Fluff up the couscous with a fork and scatter over the coriander to serve. Serve with extra harissa, if you like.",
    "description": "Chicken · Moroccan",
    "category": "Chicken",
    "image_url": "https://www.themealdb.com/images/media/meals/qxytrx1511304021.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "1 tbsp"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Chicken Breast",
        "quantity": "200g"
      },
      {
        "item": "Ginger",
        "quantity": "pinch"
      },
      {
        "item": "Harissa Spice",
        "quantity": "2 tblsp"
      },
      {
        "item": "Dried Apricots",
        "quantity": "10"
      },
      {
        "item": "Chickpeas",
        "quantity": "220g"
      },
      {
        "item": "Couscous",
        "quantity": "200g"
      },
      {
        "item": "Chicken Stock",
        "quantity": "200ml"
      },
      {
        "item": "Coriander",
        "quantity": "Handful"
      }
    ]
  },
  {
    "name": "Chilli prawn linguine",
    "instructions": "Mix the dressing ingredients in a small bowl and season with salt and pepper. Set aside.\r\n\r\nCook the pasta according to the packet instructions. Add the sugar snap peas for the last minute or so of cooking time.\r\n\r\nMeanwhile, heat the oil in a wok or large frying pan, toss in the garlic and chilli and cook over a fairly gentle heat for about 30 seconds without letting the garlic brown. Tip in the prawns and cook over a high heat, stirring frequently, for about 3 minutes until they turn pink.\r\n\r\nAdd the tomatoes and cook, stirring occasionally, for 3 minutes until they just start to soften. Drain the pasta and sugar snaps well, then toss into the prawn mixture. Tear in the basil leaves, stir, and season with salt and pepper.\r\n\r\nServe with salad leaves drizzled with the lime dressing, and warm crusty bread.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/usywpp1511189717.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Linguine Pasta",
        "quantity": "280g"
      },
      {
        "item": "Sugar Snap Peas",
        "quantity": "200g"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tblsp"
      },
      {
        "item": "Garlic Clove",
        "quantity": "2 cloves chopped"
      },
      {
        "item": "Red Chilli",
        "quantity": "1 large"
      },
      {
        "item": "King Prawns",
        "quantity": "24 Skinned"
      },
      {
        "item": "Cherry Tomatoes",
        "quantity": "12"
      },
      {
        "item": "Basil Leaves",
        "quantity": "Handful"
      },
      {
        "item": "Lettuce",
        "quantity": "Leaves"
      },
      {
        "item": "Bread",
        "quantity": "to serve"
      },
      {
        "item": "Fromage Frais",
        "quantity": "2 tbsp"
      },
      {
        "item": "Lime",
        "quantity": "Grated Zest of 2"
      },
      {
        "item": "Caster Sugar",
        "quantity": "2 tsp"
      }
    ]
  },
  {
    "name": "Fettuccine Alfredo",
    "instructions": "Cook pasta according to package instructions in a large pot of boiling water and salt. Add heavy cream and butter to a large skillet over medium heat until the cream bubbles and the butter melts. Whisk in parmesan and add seasoning (salt and black pepper). Let the sauce thicken slightly and then add the pasta and toss until coated in sauce. Garnish with parsley, and it's ready.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/0jv5gx1661040802.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Fettuccine",
        "quantity": "1 lb"
      },
      {
        "item": "Heavy Cream",
        "quantity": "1/2 cup"
      },
      {
        "item": "Butter",
        "quantity": "1/2 cup"
      },
      {
        "item": "Parmesan",
        "quantity": "1/2 cup"
      },
      {
        "item": "Parsley",
        "quantity": "2 tbsp"
      },
      {
        "item": "Black Pepper",
        "quantity": ""
      }
    ]
  },
  {
    "name": "Fettucine alfredo",
    "instructions": "In a medium saucepan, stir the clotted cream, butter and cornflour over a low-ish heat and bring to a low simmer. Turn off the heat and keep warm.\r\nMeanwhile, put the cheese and nutmeg in a small bowl and add a good grinding of black pepper, then stir everything together (don’t add any salt at this stage).\r\nPut the pasta in another pan with 2 tsp salt, pour over some boiling water and cook following pack instructions (usually 3-4 mins). When cooked, scoop some of the cooking water into a heatproof jug or mug and drain the pasta, but not too thoroughly.\r\nAdd the pasta to the pan with the clotted cream mixture, then sprinkle over the cheese and gently fold everything together over a low heat using a rubber spatula. When combined, splash in 3 tbsp of the cooking water. At first, the pasta will look wet and sloppy: keep stirring until the water is absorbed and the sauce is glossy. Check the seasoning before transferring to heated bowls. Sprinkle over some chives or parsley, then serve immediately.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/uquqtu1511178042.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Clotted Cream",
        "quantity": "227g"
      },
      {
        "item": "Butter",
        "quantity": "25g"
      },
      {
        "item": "Corn Flour",
        "quantity": "1 tsp"
      },
      {
        "item": "Parmesan Cheese",
        "quantity": "100g"
      },
      {
        "item": "Nutmeg",
        "quantity": "Grated"
      },
      {
        "item": "Fettuccine",
        "quantity": "250g"
      },
      {
        "item": "Parsley",
        "quantity": "Chopped"
      }
    ]
  },
  {
    "name": "Grilled Mac and Cheese Sandwich",
    "instructions": "Make the mac and cheese\r\n\r\n1. Bring a medium saucepan of generously salted water (you want it to taste like seawater) to a boil. Add the pasta and cook, stirring occasionally, until al dente, 8 to 10 minutes, or according to the package directions. The pasta should be tender but still chewy.\r\n2. While the pasta is cooking, in a small bowl, whisk together the flour, mustard powder, garlic powder, salt, black pepper, and cayenne pepper.\r\n3. Drain the pasta in a colander. Place the empty pasta pan (no need to wash it) over low heat and add the butter. When the butter has melted, whisk in the flour mixture and continue to cook, whisking frequently, until the mixture is beginning to brown and has a pleasant, nutty aroma, about 1 minute. Watch carefully so it does not scorch on the bottom of the pan.\r\n4. Slowly whisk the milk and cream into the flour mixture until everything is really well combined. Cook, whisking constantly, until the sauce is heated through and just begins to thicken, about 2 minutes. Remove from the heat. Gradually add the cheese while stirring constantly with a wooden spoon or silicone spatula and keep stirring until the cheese has melted into the sauce. Then stir in the drained cooked pasta.\r\n5. Line a 9-by-13-inch (23-by-33-centimeter) rimmed baking sheet with parchment paper or aluminum foil. Coat the paper or foil with nonstick cooking spray or slick it with butter. Pour the warm mac and cheese onto the prepared baking sheet and spread it evenly with a spatula. Coat another piece of parchment paper with cooking spray or butter and place it, oiled or buttered side down, directly on the surface of the mac and cheese. Refrigerate until cool and firm, about 1 hour.\r\n\r\nMake the grilled cheese\r\n6. Heat a large cast-iron or nonstick skillet over medium-low heat.\r\n7. In a small bowl, stir together the 4 tablespoons (55 grams) butter and garlic powder until well blended.\r\n8. Remove the mac and cheese from the refrigerator and peel off the top layer of parchment paper. Carefully cut into 8 equal pieces. Each piece will make 1 grilled mac and cheese sandwich. (You can stash each individual portion in a double layer of resealable plastic bags and refrigerate for up to 3 days or freeze it for up to 1 month.)\r\n9. Spread 3/4 teaspoon garlic butter on one side of each bread slice. Place half of the slices, buttered-side down, on a clean cutting board. Top each with one slice of Cheddar, then 1 piece of the mac and cheese. (Transfer from the baking sheet by scooting your hand or a spatula under each piece of mac and cheese and then flipping it over onto a sandwich.) Place 1 slice of Jack on top of each. Finish with the remaining bread slices, buttered-side up.\r\n10. Using a wide spatula, place as many sandwiches in the pan as will fit without crowding it. Cover and cook until the bottoms are nicely browned, about 4 minutes. Turn and cook until the second sides are browned, the cheese is melted, and the mac and cheese is heated through, about 4 minutes more.\r\n11. Repeat with the remaining ingredients. Cut the sandwiches in half, if desired, and serve.",
    "description": "Pasta · American",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/xutquv1505330523.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Macaroni",
        "quantity": "8 ounces (230 grams)"
      },
      {
        "item": "Plain Flour",
        "quantity": "1/3 cup"
      },
      {
        "item": "Mustard Powder",
        "quantity": "3/4 teaspoon"
      },
      {
        "item": "Garlic powder",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Kosher salt",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Black pepper",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Cayenne pepper",
        "quantity": "1/8 teaspoon"
      },
      {
        "item": "Butter",
        "quantity": "6 tablespoons (85 grams)"
      },
      {
        "item": "Whole Milk",
        "quantity": "1 1/2 cups (360 milliliters)"
      },
      {
        "item": "Heavy Cream",
        "quantity": "1 cup (240 milliliters)"
      },
      {
        "item": "Monterey Jack Cheese",
        "quantity": "1 pound (455 grams)"
      },
      {
        "item": "Butter",
        "quantity": "4 tablespoons (55 grams)"
      },
      {
        "item": "garlic powder",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Bread",
        "quantity": "16 slices square"
      },
      {
        "item": "Cheddar Cheese",
        "quantity": "8 slices mild"
      },
      {
        "item": "Colby Jack Cheese",
        "quantity": "8 slices"
      },
      {
        "item": "Butter",
        "quantity": "4 tablespoons (55 grams)"
      }
    ]
  },
  {
    "name": "Lasagna Sandwiches",
    "instructions": "1. In a small bowl, combine the first four ingredients; spread on four slices of bread. Layer with bacon, tomato and cheese; top with remaining bread.\r\n\r\n2. In a large skillet or griddle, melt 2 tablespoons butter. Toast sandwiches until lightly browned on both sides and cheese is melted, adding butter if necessary.\r\n\r\nNutrition Facts\r\n1 sandwich: 445 calories, 24g fat (12g saturated fat), 66mg cholesterol, 1094mg sodium, 35g carbohydrate (3g sugars, 2g fiber), 21g protein.",
    "description": "Pasta · American",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/xr0n4r1576788363.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Sour Cream",
        "quantity": "1/4 cup"
      },
      {
        "item": "Chopped Onion",
        "quantity": "2 tbs"
      },
      {
        "item": "Dried Oregano",
        "quantity": "1/2 tbs"
      },
      {
        "item": "Salt",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Bread",
        "quantity": "8 slices"
      },
      {
        "item": "Bacon",
        "quantity": "8 slices"
      },
      {
        "item": "Tomato",
        "quantity": "8 slices"
      },
      {
        "item": "Mozzarella",
        "quantity": "4 slices"
      },
      {
        "item": "Butter",
        "quantity": "2 1/2 Tbs"
      }
    ]
  },
  {
    "name": "Lasagne",
    "instructions": "Heat the oil in a large saucepan. Use kitchen scissors to snip the bacon into small pieces, or use a sharp knife to chop it on a chopping board. Add the bacon to the pan and cook for just a few mins until starting to turn golden. Add the onion, celery and carrot, and cook over a medium heat for 5 mins, stirring occasionally, until softened.\r\nAdd the garlic and cook for 1 min, then tip in the mince and cook, stirring and breaking it up with a wooden spoon, for about 6 mins until browned all over.\r\nStir in the tomato purée and cook for 1 min, mixing in well with the beef and vegetables. Tip in the chopped tomatoes. Fill each can half full with water to rinse out any tomatoes left in the can, and add to the pan. Add the honey and season to taste. Simmer for 20 mins.\r\nHeat oven to 200C/180C fan/gas 6. To assemble the lasagne, ladle a little of the ragu sauce into the bottom of the roasting tin or casserole dish, spreading the sauce all over the base. Place 2 sheets of lasagne on top of the sauce overlapping to make it fit, then repeat with more sauce and another layer of pasta. Repeat with a further 2 layers of sauce and pasta, finishing with a layer of pasta.\r\nPut the crème fraîche in a bowl and mix with 2 tbsp water to loosen it and make a smooth pourable sauce. Pour this over the top of the pasta, then top with the mozzarella. Sprinkle Parmesan over the top and bake for 25–30 mins until golden and bubbling. Serve scattered with basil, if you like.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/wtsvxx1511296896.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "1 tblsp"
      },
      {
        "item": "Bacon",
        "quantity": "2"
      },
      {
        "item": "Onion",
        "quantity": "1 finely chopped"
      },
      {
        "item": "Celery",
        "quantity": "1 Stick"
      },
      {
        "item": "Carrots",
        "quantity": "1 medium"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "item": "Minced Beef",
        "quantity": "500g"
      },
      {
        "item": "Tomato Puree",
        "quantity": "1 tbls"
      },
      {
        "item": "Chopped Tomatoes",
        "quantity": "800g"
      },
      {
        "item": "Honey",
        "quantity": "1 tblsp"
      },
      {
        "item": "Lasagne Sheets",
        "quantity": "500g"
      },
      {
        "item": "Creme Fraiche",
        "quantity": "400ml"
      },
      {
        "item": "Mozzarella Balls",
        "quantity": "125g"
      },
      {
        "item": "Parmesan Cheese",
        "quantity": "50g"
      },
      {
        "item": "Basil Leaves",
        "quantity": "Topping"
      }
    ]
  },
  {
    "name": "Pilchard puttanesca",
    "instructions": "Cook the pasta following pack instructions. Heat the oil in a non-stick frying pan and cook the onion, garlic and chilli for 3-4 mins to soften. Stir in the tomato purée and cook for 1 min, then add the pilchards with their sauce. Cook, breaking up the fish with a wooden spoon, then add the olives and continue to cook for a few more mins.\r\n\r\nDrain the pasta and add to the pan with 2-3 tbsp of the cooking water. Toss everything together well, then divide between plates and serve, scattered with Parmesan.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/vvtvtr1511180578.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Spaghetti",
        "quantity": "300g"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 tbls"
      },
      {
        "item": "Onion",
        "quantity": "1 finely chopped"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "item": "Red Chilli",
        "quantity": "1"
      },
      {
        "item": "Tomato Puree",
        "quantity": "1 tbls"
      },
      {
        "item": "Pilchards",
        "quantity": "425g"
      },
      {
        "item": "Black Olives",
        "quantity": "70g"
      },
      {
        "item": "Parmesan",
        "quantity": "Shaved"
      }
    ]
  },
  {
    "name": "Spaghetti alla Carbonara",
    "instructions": "STEP 1\r\nPut a large saucepan of water on to boil.\r\n\r\nSTEP 2\r\nFinely chop the 100g pancetta, having first removed any rind. Finely grate 50g pecorino cheese and 50g parmesan and mix them together.\r\n\r\nSTEP 3\r\nBeat the 3 large eggs in a medium bowl and season with a little freshly grated black pepper. Set everything aside.\r\n\r\nSTEP 4\r\nAdd 1 tsp salt to the boiling water, add 350g spaghetti and when the water comes back to the boil, cook at a constant simmer, covered, for 10 minutes or until al dente (just cooked).\r\n\r\nSTEP 5\r\nSquash 2 peeled plump garlic cloves with the blade of a knife, just to bruise it.\r\n\r\nSTEP 6\r\nWhile the spaghetti is cooking, fry the pancetta with the garlic. Drop 50g unsalted butter into a large frying pan or wok and, as soon as the butter has melted, tip in the pancetta and garlic.\r\n\r\nSTEP 7\r\nLeave to cook on a medium heat for about 5 minutes, stirring often, until the pancetta is golden and crisp. The garlic has now imparted its flavour, so take it out with a slotted spoon and discard.\r\n\r\nSTEP 8\r\nKeep the heat under the pancetta on low. When the pasta is ready, lift it from the water with a pasta fork or tongs and put it in the frying pan with the pancetta. Don’t worry if a little water drops in the pan as well (you want this to happen) and don’t throw the pasta water away yet.\r\n\r\nSTEP 9\r\nMix most of the cheese in with the eggs, keeping a small handful back for sprinkling over later.\r\n\r\nSTEP 10\r\nTake the pan of spaghetti and pancetta off the heat. Now quickly pour in the eggs and cheese. Using the tongs or a long fork, lift up the spaghetti so it mixes easily with the egg mixture, which thickens but doesn’t scramble, and everything is coated.\r\n\r\nSTEP 11\r\nAdd extra pasta cooking water to keep it saucy (several tablespoons should do it). You don’t want it wet, just moist. Season with a little salt, if needed.\r\n\r\nSTEP 12\r\nUse a long-pronged fork to twist the pasta on to the serving plate or bowl. Serve immediately with a little sprinkling of the remaining cheese and a grating of black pepper. If the dish does get a little dry before serving, splash in some more hot pasta water and the glossy sauciness will be revived.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/llcbn01574260722.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Spaghetti",
        "quantity": "320g"
      },
      {
        "item": "Egg Yolks",
        "quantity": "6"
      },
      {
        "item": "Salt",
        "quantity": "As required"
      },
      {
        "item": "Bacon",
        "quantity": "150g"
      },
      {
        "item": "Pecorino",
        "quantity": "50g"
      },
      {
        "item": "Black Pepper",
        "quantity": "As required"
      }
    ]
  },
  {
    "name": "Syrian Spaghetti",
    "instructions": "Preheat oven to 350 degrees F (175 degrees C). Grease a 9x13 inch baking dish.\r\n\r\nBring a large pot of lightly salted water to a boil. Add spaghetti and cook for 8 to 10 minutes or until al dente; drain and stir in tomato sauce, tomato paste, cinnamon, oil, salt and pepper. Transfer to prepared dish.\r\n\r\nBake in preheated oven for 1 hour, or until top is crunchy.",
    "description": "Pasta · Syrian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/5fu4ew1760524857.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Spaghetti",
        "quantity": "16 ounces"
      },
      {
        "item": "Tomato Sauce",
        "quantity": "8 ounces"
      },
      {
        "item": "Tomato Puree",
        "quantity": "6 oz"
      },
      {
        "item": "Cinnamon",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "1/4 cup"
      },
      {
        "item": "Salt",
        "quantity": "Dash"
      },
      {
        "item": "Pepper",
        "quantity": "Dash"
      }
    ]
  },
  {
    "name": "Venetian Duck Ragu",
    "instructions": "Heat the oil in a large pan. Add the duck legs and brown on all sides for about 10 mins. Remove to a plate and set aside. Add the onions to the pan and cook for 5 mins until softened. Add the garlic and cook for a further 1 min, then stir in the cinnamon and flour and cook for a further min. Return the duck to the pan, add the wine, tomatoes, stock, herbs, sugar and seasoning. Bring to a simmer, then lower the heat, cover with a lid and cook for 2 hrs, stirring every now and then.\r\nCarefully lift the duck legs out of the sauce and place on a plate – they will be very tender so try not to lose any of the meat. Pull off and discard the fat, then shred the meat with 2 forks and discard the bones. Add the meat back to the sauce with the milk and simmer, uncovered, for a further 10-15 mins while you cook the pasta.\r\nCook the pasta following pack instructions, then drain, reserving a cup of the pasta water, and add the pasta to the ragu. Stir to coat all the pasta in the sauce and cook for 1 min more, adding a splash of cooking liquid if it looks dry. Serve with grated Parmesan, if you like.",
    "description": "Pasta · Italian",
    "category": "Pasta",
    "image_url": "https://www.themealdb.com/images/media/meals/qvrwpt1511181864.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "1 tbls"
      },
      {
        "item": "Duck Legs",
        "quantity": "4"
      },
      {
        "item": "Onions",
        "quantity": "2 finely chopped"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves minced"
      },
      {
        "item": "Cinnamon",
        "quantity": "2 tsp ground"
      },
      {
        "item": "Plain Flour",
        "quantity": "2 tsp"
      },
      {
        "item": "Red Wine",
        "quantity": "250ml"
      },
      {
        "item": "Chopped Tomatoes",
        "quantity": "800g"
      },
      {
        "item": "Chicken Stock Cube",
        "quantity": "1"
      },
      {
        "item": "Rosemary",
        "quantity": "3 sprigs"
      },
      {
        "item": "Bay Leaves",
        "quantity": "2"
      },
      {
        "item": "Sugar",
        "quantity": "1 tsp"
      },
      {
        "item": "Milk",
        "quantity": "2 tbs"
      },
      {
        "item": "Paccheri Pasta",
        "quantity": "600g"
      },
      {
        "item": "Parmesan Cheese",
        "quantity": "Grated"
      }
    ]
  },
  {
    "name": "Arroz con gambas y calamar",
    "instructions": "step 1\r\nPeel and devein most of the prawns (a fishmonger should be able to do this for you), keeping a few whole for decoration, if you like. Heat the olive oil in a large frying pan or shallow flameproof casserole over a medium-low heat and fry the onion for 5 mins until softened. Add the bay leaf, saffron, rice and tomato purée, and cook for 1-2 mins more, stirring.\r\n\r\nstep 2\r\nPour in the wine and bubble for 1-2 mins, then pour in the seafood stock and 150ml water. Cook for 5 mins, then add the squid, season well and stir to combine. Bring to the boil, then cover and reduce the heat to a gentle simmer. Cook for 12 mins more, adding a little more water if the mixture starts to look dry.\r\n\r\nstep 3\r\nUncover the pan and stir through the peeled prawns, then arrange any whole prawns on top of the rice mixture. Cover again and simmer for a further 5-6 mins until the prawns are pink and cooked through. Leave to stand for a couple of minutes before serving from the pan.",
    "description": "Seafood · Spanish",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/jc6oub1763196663.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Raw King Prawns",
        "quantity": "24"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tbsp"
      },
      {
        "item": "Onion",
        "quantity": "1 small"
      },
      {
        "item": "Bay Leaf",
        "quantity": "1"
      },
      {
        "item": "Saffron",
        "quantity": "1 pinch"
      },
      {
        "item": "Paella Rice",
        "quantity": "450g"
      },
      {
        "item": "Tomato Puree",
        "quantity": "2 teaspoons"
      },
      {
        "item": "White Wine",
        "quantity": "200ml"
      },
      {
        "item": "Seafood stock",
        "quantity": "650ml"
      },
      {
        "item": "Squid",
        "quantity": "3 Medium"
      }
    ]
  },
  {
    "name": "Baked salmon with fennel & tomatoes",
    "instructions": "Heat oven to 180C/fan 160C/gas 4. Trim the fronds from the fennel and set aside. Cut the fennel bulbs in half, then cut each half into 3 wedges. Cook in boiling salted water for 10 mins, then drain well. Chop the fennel fronds roughly, then mix with the parsley and lemon zest.\r\n\r\nSpread the drained fennel over a shallow ovenproof dish, then add the tomatoes. Drizzle with olive oil, then bake for 10 mins. Nestle the salmon among the veg, sprinkle with lemon juice, then bake 15 mins more until the fish is just cooked. Scatter over the parsley and serve.",
    "description": "Seafood · British",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/1548772327.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Fennel",
        "quantity": "2 medium"
      },
      {
        "item": "Parsley",
        "quantity": "2 tbs chopped"
      },
      {
        "item": "Lemon",
        "quantity": "Juice of 1"
      },
      {
        "item": "Cherry Tomatoes",
        "quantity": "175g"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 tbs"
      },
      {
        "item": "Salmon",
        "quantity": "350g"
      },
      {
        "item": "Black Olives",
        "quantity": "to serve"
      }
    ]
  },
  {
    "name": "Bang bang prawn salad",
    "instructions": "step 1\r\nCook the noodles following pack instructions, then rinse under cold water and drain thoroughly. In a small saucepan melt together the peanut butter, coconut milk, sweet chilli sauce and half the spring onions, adding 1-2 tbsp of water to loosen the mixture to a drizzling consistency.\r\n\r\nstep 2\r\nMix the noodles, cucumber and beansprouts in a serving dish. Top with the prawns, drizzle over the peanut sauce and scatter over the remaining spring onions.",
    "description": "Seafood · Vietnamese",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/4xcfai1763765676.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Rice Noodles",
        "quantity": "140g"
      },
      {
        "item": "Peanut Butter",
        "quantity": "3 tablespoons"
      },
      {
        "item": "Coconut Milk",
        "quantity": "4 tablespoons"
      },
      {
        "item": "sweet chilli sauce",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Spring Onions",
        "quantity": "3 sliced thinly"
      },
      {
        "item": "Cucumber",
        "quantity": "1 sliced"
      },
      {
        "item": "Bean Sprouts",
        "quantity": "300g"
      },
      {
        "item": "Prawns",
        "quantity": "200g"
      }
    ]
  },
  {
    "name": "Barramundi with Moroccan spices",
    "instructions": "step 1\r\nTip all the dressing ingredients into a food processor with a pinch of salt and blitz to a dressing. Slash the fish three times on each side, coat with half of the dressing, then set aside to marinate for about 30 mins.\r\n\r\nstep 2\r\nHeat oven to 220C/fan 200C/gas 7. Place the fish on a roasting tray, then cook in the oven for 20 mins until the flesh is firm and the eyes have turned white. Serve the fish with the rest of the dressing and steamed couscous or rice.\r\n\r\nstep 3\r\nKNOW HOW: HOW TO COOK IT: Cooking barramundi on the bone, as we have done here, has its advantages – it will stay more moist during cooking, and some would say that the flavour is enhanced, too. If you want to take out the bones they are easy to locate and less likely to be lodged in the fillet if the fish is cooked whole. Fillets can be simply pan-fried or grilled. If you like trout, you will really enjoy the flavour of barramundi, which lends itself to similar ingredients and cooking methods – citrus flavours are particularly good, as are garlic and wild mushrooms. Simply roasting the fish with some fresh herbs, olive oil and seasoning is delicious, and in the summer months you could barbecue it, too. One thing that you mustn’t miss are the cheeks or ‘pearls’ of the fish, these are simply lovely, moist and really sweet – well worth leaving the head on for!",
    "description": "Seafood · Australian",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/4o4wh11761848573.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "barramundi",
        "quantity": "2 x 400g"
      },
      {
        "item": "Ground Cumin",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Coriander",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "Pinch"
      },
      {
        "item": "Chili Powder",
        "quantity": "Pinch"
      },
      {
        "item": "Garlic Clove",
        "quantity": "2"
      },
      {
        "item": "Lemon",
        "quantity": "Juice of 1"
      },
      {
        "item": "Olive Oil",
        "quantity": "5 tablespoons"
      },
      {
        "item": "Coriander",
        "quantity": "Bunch"
      }
    ]
  },
  {
    "name": "Cajun spiced fish tacos",
    "instructions": "Cooking in a cajun spice and cayenne pepper marinade makes this fish super succulent and flavoursome. Top with a zesty dressing and serve in a tortilla for a quick, fuss-free main that's delightfully summery.\r\n\r\nOn a large plate, mix the cajun spice and cayenne pepper with a little seasoning and use to coat the fish all over.\r\n\r\nHeat a little oil in a frying pan, add in the fish and cook over a medium heat until golden. Reduce the heat and continue frying until the fish is cooked through, about 10 minutes. Cook in batches if you don’t have enough room in the pan.\r\n\r\nMeanwhile, prepare the dressing by combining all the ingredients with a little seasoning.\r\nSoften the tortillas by heating in the microwave for 5-10 seconds. Pile high with the avocado, lettuce and spring onion, add a spoonful of salsa, top with large flakes of fish and drizzle over the dressing.",
    "description": "Seafood · Mexican",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/uvuyxu1503067369.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "cajun",
        "quantity": "2 tbsp"
      },
      {
        "item": "cayenne pepper",
        "quantity": "1 tsp"
      },
      {
        "item": "white fish",
        "quantity": "4 fillets"
      },
      {
        "item": "vegetable oil",
        "quantity": "1 tsp"
      },
      {
        "item": "flour tortilla",
        "quantity": "8"
      },
      {
        "item": "avocado",
        "quantity": "1 sliced"
      },
      {
        "item": "little gem lettuce",
        "quantity": "2 shredded"
      },
      {
        "item": "Spring Onions",
        "quantity": "4 shredded"
      },
      {
        "item": "salsa",
        "quantity": "1 x 300ml"
      },
      {
        "item": "sour cream",
        "quantity": "1 pot"
      },
      {
        "item": "lemon",
        "quantity": "1"
      },
      {
        "item": "garlic",
        "quantity": "1 clove finely chopped"
      }
    ]
  },
  {
    "name": "Clam, chorizo & white bean stew",
    "instructions": "step 1\r\nFry the chorizo in a large frying pan with a lid, over a medium heat until it is starting to crisp up and release its oil. Add the onion and cook for 5 mins until starting to soften. Then add the garlic and finely chopped parsley, and fry for 1 min more.\r\n\r\nstep 2\r\nPour on the stock and tomatoes. Bring to the boil, reduce the heat, then add the beans and sherry vinegar. Simmer for 10 mins until the liquid is slightly reduced.\r\n\r\nstep 3\r\nScatter over the clams, cover with the lid and steam for 2-4 mins, shaking the pan occasionally until the clams are open. Have a little taste before seasoning, as the clams can be quite salty. Then scatter over the chopped parsley. Eat with lots of crusty bread.",
    "description": "Seafood · Spanish",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/92wbmf1763252334.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chorizo",
        "quantity": "50g"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Garlic Clove",
        "quantity": "1"
      },
      {
        "item": "Parsley",
        "quantity": "Bunch"
      },
      {
        "item": "Vegetable Stock",
        "quantity": "200ml"
      },
      {
        "item": "Tinned Tomatos",
        "quantity": "400g"
      },
      {
        "item": "Butter Beans",
        "quantity": "400g"
      },
      {
        "item": "Sherry vinegar",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Clams",
        "quantity": "600g"
      },
      {
        "item": "Crusty Bread",
        "quantity": "To serve"
      }
    ]
  },
  {
    "name": "Egg Foo Young",
    "instructions": "Make the gravy:\r\nIn a small saucepan, add the beef stock, soy sauce, Shaoxing wine, oyster sauce, and white pepper powder over medium heat. Whisk together and bring to a simmer. \r\n\r\nCombine the cornstarch and water in a small bowl and whisk to dissolve. Add to the saucepan and whisk until the gravy thickens and coats the back of the spoon, 2 to 3 minutes. Cover the saucepan with a lid and keep it warm on the lowest possible heat.\r\n\r\nMake the egg foo young batter:\r\nIn a medium bowl, whisk together the cornstarch and water until dissolved. Add the eggs, salt, and sugar. Whisk until well combined and there are no more egg white clumps. \r\n\r\nAdd the green onion, bean sprouts, and shrimp. Stir until everything is evenly coated.\r\n\r\nFry the egg foo young:\r\nAdd the vegetable oil to a large wok; it should reach about 2 inches up the sides. Heat the oil over medium-high heat to 350°F, or until vigorous bubbles form around an inserted wooden chopstick. \r\n\r\nWith a ladle, gently and slowly add 1/4 of the omelet batter. Egg foo young should immediately bubble and puff up like magic. Fry until golden brown and crispy on each side, about 2 minutes per side. If there are any light spots, use a ladle to gently baste it with hot oil.\r\n\r\nTip\r\nEgg foo young can be a bit tricky to flip. The easiest method is to put a tool in each hand (a spider, slotted spoon, tongs, and large chopsticks are all good candidates) and gently coax the omelet over, pulling up on one side and pushing down and around on the other.\r\n\r\nRemove the omelet and place it on a paper towel-lined baking sheet. Let it cool for 5 minutes. Meanwhile, repeat with the remaining batter to make 4 omelets. If needed, add more oil to the pan between batches.\r\n\r\nServe and enjoy:\r\nPlate each egg foo young over a bed of rice. Spoon the warm gravy over the top and serve immediately. ",
    "description": "Seafood · Chinese",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/47y6ii1765658818.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Unsalted Beef Stock",
        "quantity": "1 cup"
      },
      {
        "item": "Soy Sauce",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Shaoxing Wine",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Oyster Sauce",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Pepper",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Cornstarch",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Water",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Cornstarch",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Water",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Egg",
        "quantity": "8 large"
      },
      {
        "item": "Kosher Salt",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Sugar",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Spring Onions",
        "quantity": "1"
      },
      {
        "item": "Mung Bean Sprouts",
        "quantity": "1 cup"
      },
      {
        "item": "Shrimp",
        "quantity": "20"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "3 Cups"
      },
      {
        "item": "Jasmine Rice",
        "quantity": "2 cups"
      }
    ]
  },
  {
    "name": "Escovitch Fish",
    "instructions": "Rinse fish; rub with lemon or lime, seasoned with salt and pepper or use your favorite seasoning. I used creole seasoning. Set aside or place in the oven to keep it warm until sauce is ready.\r\n\r\nIn large skillet heat oil over medium heat, until hot, add the fish, cook each side- for about 5-7 minutes until cooked through and crispy on both sides. Remove fish and set aside. Drain oil and leave about 2-3 tablespoons of oil\r\nAdd, bay leave, garlic and ginger, stir-fry for about a minute making sure the garlic does not burn\r\nThen add onion, bell peppers, thyme, scotch bonnet, sugar, all spice-continue stirring for about 2-3 minutes. Add vinegar, mix an adjust salt and pepper according to preference. Let it simmer for about 2 more minutes. \r\n\r\nDiscard bay leave, thyme spring and serve over fish with a side of this bammy. You may make the sauce about 2 days in advance.",
    "description": "Seafood · Jamaican",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/1520084413.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Red Snapper",
        "quantity": "2 Pounds"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "1/2 cup"
      },
      {
        "item": "Garlic",
        "quantity": "1 clove peeled crushed"
      },
      {
        "item": "Ginger",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Thyme",
        "quantity": "2 sprigs"
      },
      {
        "item": "Bay Leaf",
        "quantity": "1"
      },
      {
        "item": "Red Pepper",
        "quantity": "0.5"
      },
      {
        "item": "Yellow Pepper",
        "quantity": "0.5"
      },
      {
        "item": "Onion",
        "quantity": "1 sliced"
      },
      {
        "item": "Carrots",
        "quantity": "1 chopped"
      },
      {
        "item": "Sugar",
        "quantity": "1 tbs"
      },
      {
        "item": "Allspice",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Worcestershire Sauce",
        "quantity": "1 tsp"
      },
      {
        "item": "Scotch Bonnet",
        "quantity": "1"
      },
      {
        "item": "Lime",
        "quantity": "1"
      },
      {
        "item": "Malt Vinegar",
        "quantity": "3/4 cup"
      },
      {
        "item": "Pepper",
        "quantity": "pinch"
      }
    ]
  },
  {
    "name": "Fish fofos",
    "instructions": "STEP 1\r\n\r\nPut the fish into a lidded pan and pour over enough water to cover. Bring to a simmer and gently poach for 10 minutes over a low heat with the lid on. Drain and flake the fish.\r\n\r\nSTEP 2\r\n\r\nPut the fish, potato, green chilli, coriander, cumin, black pepper, garlic and ginger in a large bowl. Season, add the rice flour, mix well and break in 1 egg. Stir the mixture and divide into 15, then form into small logs. Break the remaining eggs into a bowl and whisk lightly. Put the breadcrumbs into another bowl. Dip each fofo in the beaten egg followed by the breadcrumb mixture. Chill for 20 minutes.\r\n\r\nSTEP 3\r\n\r\nHeat 1cm of oil in a large frying pan over a medium heat. Fry the fofos in batches for 2 minutes on each side, turning gently to get an even golden brown colour all over. Drain on kitchen paper and repeat with the remaining fofos.\r\n\r\nSTEP 4\r\n\r\nFor the onion salad, mix together the onion, coriander and lemon juice with a pinch of salt. Serve with the fofos and mango chutney.",
    "description": "Seafood · Portuguese",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/a15wsa1614349126.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Haddock",
        "quantity": "600g"
      },
      {
        "item": "Potatoes",
        "quantity": "300g"
      },
      {
        "item": "Green Chilli",
        "quantity": "1 chopped"
      },
      {
        "item": "Coriander",
        "quantity": "3 tbs"
      },
      {
        "item": "Cumin Seeds",
        "quantity": "1 tsp"
      },
      {
        "item": "Pepper",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Garlic",
        "quantity": "3 cloves"
      },
      {
        "item": "Ginger",
        "quantity": "2 pieces"
      },
      {
        "item": "Flour",
        "quantity": "2 tbs"
      },
      {
        "item": "Eggs",
        "quantity": "3"
      },
      {
        "item": "Breadcrumbs",
        "quantity": "75g"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "For frying"
      }
    ]
  },
  {
    "name": "Fish pie",
    "instructions": "01.Put the potatoes in a large pan of cold salted water and bring to the boil. Lower the heat, cover, then simmer gently for 15 minutes until tender. Drain, then return to the pan over a low heat for 30 seconds to drive off any excess water. Mash with 1 tbsp olive oil, then season.\r\n02.Meanwhile put the milk in a large sauté pan, add the fish and bring to the boil. Remove from the heat, cover and stand for 3 minutes. Remove the fish (reserving the milk) and pat dry with kitchen paper, then gently flake into an ovenproof dish, discarding the skin and any bones.\r\n03.Heat the remaining oil in a pan, stir in the flour and cook for 30 seconds. Gradually stir in 200-250ml of the reserved milk (discard the rest). Grate in nutmeg, season, then bubble until thick. Stir in the cream.\r\n04.Preheat the oven to 190°C/fan170°C/gas 5. Grate the artichokes and add to the dish with the leek, prawns and herbs. Stir the lemon zest and juice into the sauce, then pour over. Mix gently with a wooden spoon.\r\n05.Spoon the mash onto the fish mixture, then use a fork to make peaks, which will crisp and brown as it cooks. Sprinkle over the cheese, then bake for 35-40 minutes until golden and bubbling. Serve with wilted greens.",
    "description": "Seafood · British",
    "category": "Seafood",
    "image_url": "https://www.themealdb.com/images/media/meals/ysxwuq1487323065.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Floury Potatoes",
        "quantity": "900g"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tbsp"
      },
      {
        "item": "Semi-skimmed Milk",
        "quantity": "600ml"
      },
      {
        "item": "White Fish Fillets",
        "quantity": "800g"
      },
      {
        "item": "Plain flour",
        "quantity": "1 tbsp"
      },
      {
        "item": "Nutmeg",
        "quantity": "Grating"
      },
      {
        "item": "Double Cream",
        "quantity": "3 tbsp"
      },
      {
        "item": "Jerusalem Artichokes",
        "quantity": "200g"
      },
      {
        "item": "Leek",
        "quantity": "1 finely sliced"
      },
      {
        "item": "Prawns",
        "quantity": "200g peeled raw"
      },
      {
        "item": "Parsley",
        "quantity": "Large handful"
      },
      {
        "item": "Dill",
        "quantity": "Handful"
      },
      {
        "item": "Lemon",
        "quantity": "Grated zest of 1"
      },
      {
        "item": "Gruyère",
        "quantity": "25g grated"
      },
      {
        "item": "Lemon",
        "quantity": "Juice of 1"
      }
    ]
  },
  {
    "name": "Air fryer patatas bravas",
    "instructions": "step 1\r\nSoak the potatoes in just-boiled water for 30 mins, then drain and leave to air-dry for 5 mins. Heat the air fryer to 200C. Tip the potatoes into a bowl and drizzle over 1 tbsp of the oil and add 1/2 tsp each of salt and freshly ground black pepper. Mix to coat the potatoes all over, then tip into the air fryer basket and cook for 20-30 mins until crisp and golden.\r\n\r\nstep 2\r\nMeanwhile, heat the remaining oil in a small pan over a medium-low heat and fry the onion for 8-10 mins until softened but not golden. Stir in the garlic and cook for a minute before adding the paprika and cooking for 30 seconds more. Stir in the tomato purée, cook for 1 min, then tip in the chopped tomatoes. Cook for 5-10 mins over a medium heat until thickened slightly.\r\n\r\nstep 3\r\nOnce the potatoes are cooked, tip out onto a platter and pour over the tomato sauce. Sprinkle with the basil leaves, then serve.",
    "description": "Vegetarian · Spanish",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/3m8yae1763257951.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Potatoes",
        "quantity": "900g"
      },
      {
        "item": "Olive Oil",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Garlic",
        "quantity": "1 clove peeled crushed"
      },
      {
        "item": "Paprika",
        "quantity": "1 tblsp"
      },
      {
        "item": "Tomato Puree",
        "quantity": "1 tblsp"
      },
      {
        "item": "Tinned Tomatos",
        "quantity": "225g"
      },
      {
        "item": "Basil Leaves",
        "quantity": "To serve"
      }
    ]
  },
  {
    "name": "Algerian Flafla (Bell Pepper Salad)",
    "instructions": "Preheat an oven to 450 degrees F (230 degrees C). Place the whole peppers on aluminum foil. Bake until the skin is spotted black and the peppers are soft, 30 to 45 minutes, turning the peppers once if necessary.\r\n\r\nRemove peppers from the oven and set aside to cool for 10 minutes. Peel off the skin and remove the stem and seeds. Chop the roasted peppers into half-inch pieces.\r\n\r\nHeat the olive oil in a skillet over medium heat. Stir in the onion and cook, stirring frequently, until the onion has softened and turned translucent, about 5 minutes. Add the garlic, salt, and pepper; stir in the chopped peppers and tomato. Cook over medium heat, stirring occasionally, until the tomato is soft and the mixture is well incorporated, about 5 minutes.",
    "description": "Vegetarian · Algerian",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/tbj1bs1764118062.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Green Pepper",
        "quantity": "3"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Red Onions",
        "quantity": "1 tablespoon chopped"
      },
      {
        "item": "Garlic",
        "quantity": "1 clove peeled crushed"
      },
      {
        "item": "Salt",
        "quantity": "To taste"
      },
      {
        "item": "Pepper",
        "quantity": "To taste"
      },
      {
        "item": "Plum Tomatoes",
        "quantity": "1 Diced"
      }
    ]
  },
  {
    "name": "Aubergine & hummus grills",
    "instructions": "step 1\r\nLay the aubergine out in one layer on a large baking sheet. Brush sparingly with vegetable oil, then season generously. Grill for 15 mins, turning twice and brushing with oil until the slices are softened and cooked through. Meanwhile, whizz the bread into crumbs. Add 2 tsp oil and whizz briefly again, to coat.\r\n\r\nstep 2\r\nSpread a couple of tsps of hummus on top of each slice of aubergine. Tip the breadcrumbs onto a large plate, then press the hummus side of the aubergines into the crumbs to coat. Grill again, crumb-side up, for about 3 mins until golden.\r\n\r\nstep 3\r\nToss the walnuts, parsley and cherry tomatoes in a bowl, season, then add the lemon juice and olive oil and toss again. Serve the grills with the salad, a dollop more hummus and some pitta bread.",
    "description": "Vegetarian · Turkish",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/zub3s91764110535.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Aubergine",
        "quantity": "2"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Bread",
        "quantity": "3 sliced thinly"
      },
      {
        "item": "Hummus",
        "quantity": "300g"
      },
      {
        "item": "Walnuts",
        "quantity": "100g"
      },
      {
        "item": "Parsley",
        "quantity": "40g"
      },
      {
        "item": "Cherry Tomatoes",
        "quantity": "200g"
      },
      {
        "item": "Lemon",
        "quantity": "Juice of 1/2"
      },
      {
        "item": "Extra Virgin Olive Oil",
        "quantity": "Splash"
      }
    ]
  },
  {
    "name": "Aubergine couscous salad",
    "instructions": "step 1\r\nHeat grill to high. Put the aubergine on a baking sheet, brush with oil and season. Grill for about 15 mins, turning and brushing with more oil halfway, until browned and softened.\r\n\r\nstep 2\r\nMeanwhile, tip the couscous into a large bowl, pour over the stock, then cover and leave for 10 mins. Mix the tomatoes, mint, goat’s cheese and remaining oil together. Fluff the couscous up with a fork, then stir in the aubergines, tomato mixture and lemon juice.",
    "description": "Vegetarian · Turkish",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/02s6gc1763799560.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Aubergine",
        "quantity": "1 sliced"
      },
      {
        "item": "Olive Oil",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Couscous",
        "quantity": "140g"
      },
      {
        "item": "Vegetable Stock",
        "quantity": "225g"
      },
      {
        "item": "Cherry Tomatoes",
        "quantity": "200g"
      },
      {
        "item": "Mint",
        "quantity": "Handful"
      },
      {
        "item": "Goats Cheese",
        "quantity": "100g"
      },
      {
        "item": "Lemon",
        "quantity": "Juice of 1/2"
      }
    ]
  },
  {
    "name": "Avocado dip with new potatoes",
    "instructions": "step 1\r\nWhizz half the avocado flesh with the yogurt, lime and lemon juice and seasoning. Dice the remaining avocado, then gently stir into the whizzed mix with most of the lime zest. Cover, then chill until ready to serve.\r\n\r\nstep 2\r\nBoil potatoes for 6 mins, then drain well and toss with olive oil, chilli powder and cumin seeds. Now set aside until half an hour before your guests arrive.\r\n\r\nstep 3\r\nHeat oven to 200C/180C fan/gas 6, then roast potatoes for about 30 mins, shaking the tray halfway, until golden and tender. Transfer the dip to one or two bowls, scatter with the remaining lime zest and serve with the hot potatoes, and tortilla chips for dipping.",
    "description": "Vegetarian · Australian",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/flrajf1762341295.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Avocado",
        "quantity": "3 Large"
      },
      {
        "item": "Natural Yoghurt",
        "quantity": "200g"
      },
      {
        "item": "Lime",
        "quantity": "Zest and juice of 1"
      },
      {
        "item": "Lemon",
        "quantity": "Juice of 1/2"
      },
      {
        "item": "Baby New Potatoes",
        "quantity": "1.25kg"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Hot Chilli Powder",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Cumin Seeds",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Tortillas",
        "quantity": "200g"
      }
    ]
  },
  {
    "name": "Baingan Bharta",
    "instructions": "Rinse the baingan (eggplant or aubergine) in water. Pat dry with a kitchen napkin. Apply some oil all over and\r\nkeep it for roasting on an open flame. You can also grill the baingan or roast in the oven. But then you won't get\r\nthe smoky flavor of the baingan. Keep the eggplant turning after a 2 to 3 minutes on the flame, so that its evenly\r\ncooked. You could also embed some garlic cloves in the baingan and then roast it.\r\n2. Roast the aubergine till its completely cooked and tender. With a knife check the doneness. The knife should slid\r\neasily in aubergines without any resistance. Remove the baingan and immerse in a bowl of water till it cools\r\ndown.\r\n3. You can also do the dhungar technique of infusing charcoal smoky flavor in the baingan. This is an optional step.\r\nUse natural charcoal for this method. Heat a small piece of charcoal on flame till it becomes smoking hot and red.\r\n4. Make small cuts on the baingan with a knife. Place the red hot charcoal in the same plate where the roasted\r\naubergine is kept. Add a few drops of oil on the charcoal. The charcoal would begin to smoke.\r\n5. As soon as smoke begins to release from the charcoal, cover the entire plate tightly with a large bowl. Allow the\r\ncharcoal smoke to get infused for 1 to 2 minutes. The more you do, the more smoky the baingan bharta will\r\nbecome. I just keep for a minute. Alternatively, you can also do this dhungar method once the baingan bharta is\r\ncooked, just like the way we do for Dal Tadka.\r\n6. Peel the skin from the roasted and smoked eggplant.\r\n7. Chop the cooked eggplant finely or you can even mash it.\r\n8. In a kadai or pan, heat oil. Then add finely chopped onions and garlic.\r\n9. Saute the onions till translucent. Don't brown them.\r\n10. Add chopped green chilies and saute for a minute.\r\n11. Add the chopped tomatoes and mix it well.\r\n12. Bhuno (saute) the tomatoes till the oil starts separating from the mixture.\r\n13. Now add the red chili powder. Stir and mix well.\r\n14. Add the chopped cooked baingan.\r\n15. Stir and mix the chopped baingan very well with the onion­tomato masala mixture.\r\n16. Season with salt. Stir and saute for some more 4 to 5 minutes more.\r\n17. Finally stir in the coriander leaves with the baingan bharta or garnish it with them. Serve Baingan Bharta with\r\nphulkas, rotis or chapatis. It goes well even with bread, toasted or grilled bread and plain rice or jeera rice.",
    "description": "Vegetarian · Indian",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/urtpqw1487341253.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Aubergine",
        "quantity": "1 large"
      },
      {
        "item": "Onion",
        "quantity": "½ cup"
      },
      {
        "item": "Tomatoes",
        "quantity": "1 cup"
      },
      {
        "item": "Garlic",
        "quantity": "6 cloves"
      },
      {
        "item": "Green Chilli",
        "quantity": "1"
      },
      {
        "item": "Red Chilli Powder",
        "quantity": "¼ teaspoon"
      },
      {
        "item": "Oil",
        "quantity": "1.5 tablespoon"
      },
      {
        "item": "Coriander Leaves",
        "quantity": "1 tablespoon chopped"
      },
      {
        "item": "salt",
        "quantity": "as required"
      }
    ]
  },
  {
    "name": "Beetroot & red cabbage sauerkraut",
    "instructions": "step 1\r\nTip all the ingredients into a large bowl, add 1-1½ tsp freshly ground black pepper, then scrunch it all together with your hands for 5 mins. You might want to wear gloves to avoid staining your skin with the beetroot juices.\r\n\r\nstep 2\r\nPress the veg down in the bowl with your hands, then cover the surface and up the side of the bowl with a large sheet of compostable cling film or something reusable like a beeswax wrap. Now place another similar-sized bowl on top. Press down hard and add anything heavy (packs of rice or cans work well) to weigh it down so the juices rise to cover the surface. Cover again.\r\n\r\nstep 3\r\nLeave to ferment at room temperature for at least five days, but for maximum flavour, leave for one-five weeks (until the bubbling subsides).\r\n\r\nstep 4\r\nCheck the sauerkraut. After a few days, you will see bubbles that have built up as it ferments. Give it a stir, then cover and weigh it down again as before. The cabbage will become increasingly sour the longer it’s fermented, so taste it now and again. When you like the flavour, transfer it to sterilised jars and keep chilled. Will keep chilled for up to six months.",
    "description": "Vegetarian · Polish",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/ra2k8a1764365055.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Beetroot",
        "quantity": "320g"
      },
      {
        "item": "Red Cabbage",
        "quantity": "450g"
      },
      {
        "item": "Onion",
        "quantity": "1 small"
      },
      {
        "item": "Caraway Seed",
        "quantity": "2 tsp"
      },
      {
        "item": "Sea Salt",
        "quantity": "1 tsp"
      }
    ]
  },
  {
    "name": "Beetroot latkes",
    "instructions": "step 1\r\nHeat the oven to 180C/160C fan/gas 4. Make the latkes by combining all of the ingredients.\r\n\r\nstep 2\r\nHeat the oil in a large non-stick pan. Spoon in the mixture to make six round latkes. Fry for 4-5 mins on each side, then transfer to a baking sheet and bake for 10 mins.\r\n\r\nstep 3\r\nCombine the yogurt and mint in a small bowl. Toss the salad leaves and tomatoes together, then serve the latkes with the mint yogurt and salad.",
    "description": "Vegetarian · Ukrainian",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/qwicc91764368097.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Rapeseed Oil",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Greek Yogurt",
        "quantity": "4 tablespoons"
      },
      {
        "item": "Mint",
        "quantity": "1/2 bag"
      },
      {
        "item": "Rocket",
        "quantity": "150g"
      },
      {
        "item": "Cherry Tomatoes",
        "quantity": "130g"
      },
      {
        "item": "Beetroot",
        "quantity": "400g"
      },
      {
        "item": "Egg",
        "quantity": "1 beaten"
      },
      {
        "item": "Plain Flour",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Garlic",
        "quantity": "1 clove finely chopped"
      },
      {
        "item": "Caraway Seed",
        "quantity": "1 tsp"
      },
      {
        "item": "Ground Cumin",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Lemon",
        "quantity": "Zest of 1"
      }
    ]
  },
  {
    "name": "Beetroot Soup (Borscht)",
    "instructions": "Chop the beetroot, add water and stock cube and cook for 15mins. Add the other ingredients and boil until soft. Finally add the beans and cook for 5mins. Serve in the soup pot.",
    "description": "Vegetarian · Ukrainian",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/zadvgb1699012544.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Beetroot",
        "quantity": "3"
      },
      {
        "item": "Olive Oil",
        "quantity": "4 tbs"
      },
      {
        "item": "Chicken Stock Cube",
        "quantity": "1"
      },
      {
        "item": "Water",
        "quantity": "6 cups"
      },
      {
        "item": "Potatoes",
        "quantity": "3"
      },
      {
        "item": "Cannellini Beans",
        "quantity": "1 can"
      },
      {
        "item": "Dill",
        "quantity": "Garnish"
      }
    ]
  },
  {
    "name": "Braised stuffed cabbage",
    "instructions": "step 1\r\nHeat oven to 180C/fan 160C/gas 4. Remove the tough central stalk from the cabbage leaves. Bring a large pan of salted water to the boil, add the cabbage, then cook for just 1-2 mins until the leaves are starting to wilt. Drain and refresh under cold running water. Drain well, then pat dry with a tea towel.\r\n\r\nstep 2\r\nHeat the oil in a pan, add the onion, then fry for 5 mins until slightly browned. Add the rosemary and celery, then cook for 8 mins more. Stir in the rice, then cook for a min or so until the grains are glistening. Remove from the heat, stir in the chestnuts and cranberries, then season.\r\n\r\nstep 3\r\nSpoon a little stuffing onto a cabbage leaf, roll up and fold in the sides to enclose the filling. Put in a single layer in a large, oiled, shallow ovenproof dish with the join underneath. Fill the remaining leaves in the same way. Mix the stock, vinegar and honey, then pour over the cabbage. Cover the dish tightly with foil, bake for 1 hr, uncover, then cook for a further 15 mins.",
    "description": "Vegetarian · Polish",
    "category": "Vegetarian",
    "image_url": "https://www.themealdb.com/images/media/meals/z267f71764364072.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Cabbage Leaves",
        "quantity": "6 large"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Rosemary",
        "quantity": "2 tsp"
      },
      {
        "item": "Celery",
        "quantity": "1 chopped"
      },
      {
        "item": "Basmati Rice",
        "quantity": "140g"
      },
      {
        "item": "Cooked Chestnut",
        "quantity": "140g"
      },
      {
        "item": "Cranberry",
        "quantity": "50g"
      },
      {
        "item": "Vegetable Stock",
        "quantity": "300ml"
      },
      {
        "item": "Balsamic Vinegar",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Clear Honey",
        "quantity": "1 tsp"
      }
    ]
  },
  {
    "name": "Fasoliyyeh Bi Z-Zayt (Syrian Green Beans with Olive Oil)",
    "instructions": "Place the green beans into a large pot, and drizzle with olive oil. Season with salt to taste, and put the lid on the pot. Cook over medium-high heat, stirring occasionally, until beans are cooked to your desired doneness. Syrians like it cooked until the green beans are turning brownish in color. The idea is not to saute them, but to let them steam in the moisture released by the ice crystals.\r\n\r\nAdd cilantro and garlic to the beans, and continue to cook just until the cilantro has started to wilt. Eat as a main course by scooping up with warm pita bread or serve as a side dish.",
    "description": "Vegan · Syrian",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/21yc5s1760524759.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Green Beans",
        "quantity": "16 ounces"
      },
      {
        "item": "Olive Oil",
        "quantity": "1/4 cup"
      },
      {
        "item": "Salt",
        "quantity": "Dash"
      },
      {
        "item": "Garlic",
        "quantity": "1 clove"
      },
      {
        "item": "Cilantro",
        "quantity": "1/4 cup"
      }
    ]
  },
  {
    "name": "Padron peppers",
    "instructions": "step 1\r\nHeat the olive oil in a large frying pan over a high heat, or if using an air-fryer, heat to 205C for 3 mins. Fry the peppers, stirring frequently, for 5 mins until blistered and wilted. The peppers should be soft and slightly charred.\r\n\r\nstep 2\r\nTransfer the peppers to a serving plate and season with some sea salt. Serve with dips or as part of a tapas spread, if you like.",
    "description": "Vegan · Spanish",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/0ljvc51763248075.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Padron peppers",
        "quantity": "500g"
      }
    ]
  },
  {
    "name": "Red onion pickle",
    "instructions": "Peel the onions, cut them in half from top to bottom and finely slice into half-moon pieces. Put in a colander placed over a bowl and sprinkle with salt, lightly turning over the onion pieces with your hands so the surfaces are all covered. Set aside for an hour or so to brine.\r\n\r\nMeanwhile put the vinegar, 50ml/2fl oz water and the sugar in a saucepan. Bring to a simmer, stirring to help the sugar dissolve, and cook for a couple of minutes. Set aside.\r\n\r\nPack the onions into the sterilised jars, sprinkling in a little pepper as you go. Cover with the warm vinegar and finish by tucking a couple of bay leaves down the side of the jars. Seal. The onions are best kept in the fridge and used within to 4 weeks.",
    "description": "Vegan · Norwegian",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/ppodrp1762325183.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Red Onions",
        "quantity": "3 Large"
      },
      {
        "item": "Sea Salt",
        "quantity": "2 tsp"
      },
      {
        "item": "Cider Vinegar",
        "quantity": "200ml"
      },
      {
        "item": "Granulated Sugar",
        "quantity": "50g"
      },
      {
        "item": "Black Pepper",
        "quantity": "1 tsp"
      },
      {
        "item": "Bay Leaves",
        "quantity": "4"
      }
    ]
  },
  {
    "name": "Roast fennel and aubergine paella",
    "instructions": "1 Put the fennel, aubergine, pepper and courgette in a roasting tray. Add a glug of olive oil, season with salt and pepper and toss around to coat the veggies in the oil. Roast in the oven for 20 minutes, turning a couple of times until the veg are pretty much cooked through and turning golden.\r\n\r\n2 Meanwhile, heat a paella pan or large frying pan over a low– medium heat and add a glug of olive oil. Sauté the onion for 8–10 minutes until softened. Increase the heat to medium and stir in the rice, paprika and saffron. Cook for around 1 minute to start toasting the rice, then add the white wine. Reduce by about half before stirring in two-thirds of the stock. Reduce to a simmer and cook for 10 minutes without a lid, stirring a couple of times.\r\n\r\n3 Stir in the peas, add some seasoning, then gently mix in the roasted veg. Pour over the remaining stock, arrange the lemon wedges on top and cover with a lid or some aluminium foil. Cook for a further 10 minutes.\r\n\r\n4 To ensure you get the classic layer of toasted rice at the bottom of the pan, increase the heat to high until you hear a slight crackle. Remove from the heat and sit for 5 minutes before sprinkling over the parsley and serving.",
    "description": "Vegan · Spanish",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/1520081754.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Baby Aubergine",
        "quantity": "6 small"
      },
      {
        "item": "Fennel",
        "quantity": "4 small"
      },
      {
        "item": "Red Pepper",
        "quantity": "1 thinly sliced"
      },
      {
        "item": "Courgettes",
        "quantity": "1 medium"
      },
      {
        "item": "Onion",
        "quantity": "1 finely chopped"
      },
      {
        "item": "Paella Rice",
        "quantity": "300g"
      },
      {
        "item": "Paprika",
        "quantity": "1 tsp"
      },
      {
        "item": "Saffron",
        "quantity": "pinch"
      },
      {
        "item": "White Wine",
        "quantity": "200ml"
      },
      {
        "item": "Vegetable Stock",
        "quantity": "700ml"
      },
      {
        "item": "Frozen Peas",
        "quantity": "100g"
      },
      {
        "item": "Lemon",
        "quantity": "1 chopped"
      },
      {
        "item": "Parsley",
        "quantity": "Handful"
      },
      {
        "item": "Salt",
        "quantity": "pinch"
      },
      {
        "item": "Black Pepper",
        "quantity": "pinch"
      }
    ]
  },
  {
    "name": "Vegan banh mi",
    "instructions": "step 1\r\nPut the shredded veg in a bowl and add the vinegar, sugar and 1 tsp salt. Toss everything together, then set aside to pickle quickly while you prepare the rest of the sandwich.\r\n\r\nstep 2\r\nHeat oven to 180C/160C fan/gas 4. Cut the baguette into four, then slice each piece horizontally in half. Put the baguette pieces in the oven for 5 mins until lightly toasted and warm. Spread each piece with a layer of hummus, then top four pieces with the tempeh slices and pile the pickled veg on top. To serve, sprinkle over the herbs and squeeze over some hot sauce, then top with the other baguette pieces to make sandwiches.",
    "description": "Vegan · Vietnamese",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/sonirb1763782831.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Raw Vegetables",
        "quantity": "150g"
      },
      {
        "item": "Vegan White Wine Vinegar",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Golden Caster Sugar",
        "quantity": "1 tsp"
      },
      {
        "item": "Baguette",
        "quantity": "1 large"
      },
      {
        "item": "Hummus",
        "quantity": "100g"
      },
      {
        "item": "Tempeh",
        "quantity": "175g"
      },
      {
        "item": "Coriander",
        "quantity": "Handful"
      },
      {
        "item": "Mint",
        "quantity": "Handful"
      },
      {
        "item": "Hotsauce",
        "quantity": "To serve"
      }
    ]
  },
  {
    "name": "Vegan Chocolate Cake",
    "instructions": "Simply mix all dry ingredients with wet ingredients and blend altogether. Bake for 45 min on 180 degrees. Decorate with some melted vegan chocolate ",
    "description": "Vegan · American",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/qxutws1486978099.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Self-raising Flour",
        "quantity": "1 1/4 cup"
      },
      {
        "item": "coco sugar",
        "quantity": "1/2 cup"
      },
      {
        "item": "cacao",
        "quantity": "1/3 cup raw"
      },
      {
        "item": "baking powder",
        "quantity": "1 tsp"
      },
      {
        "item": "flax eggs",
        "quantity": "2"
      },
      {
        "item": "almond milk",
        "quantity": "1/2 cup"
      },
      {
        "item": "vanilla",
        "quantity": "1 tsp"
      },
      {
        "item": "water",
        "quantity": "1/2 cup boiling"
      }
    ]
  },
  {
    "name": "Vegan Lasagna",
    "instructions": "1) Preheat oven to 180 degrees celcius. \r\n2) Boil vegetables for 5-7 minutes, until soft. Add lentils and bring to a gentle simmer, adding a stock cube if desired. Continue cooking and stirring until the lentils are soft, which should take about 20 minutes. \r\n3) Blanch spinach leaves for a few minutes in a pan, before removing and setting aside. \r\n4) Top up the pan with water and cook the lasagne sheets. When cooked, drain and set aside.\r\n5) To make the sauce, melt the butter and add the flour, then gradually add the soya milk along with the mustard and the vinegar. Cook and stir until smooth and then assemble the lasagne as desired in a baking dish. \r\n6) Bake in the preheated oven for about 25 minutes.",
    "description": "Vegan · Italian",
    "category": "Vegan",
    "image_url": "https://www.themealdb.com/images/media/meals/rvxxuy1468312893.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "green red lentils",
        "quantity": "1 cups"
      },
      {
        "item": "Carrots",
        "quantity": "1"
      },
      {
        "item": "onion",
        "quantity": "1"
      },
      {
        "item": "zucchini",
        "quantity": "1 small"
      },
      {
        "item": "coriander",
        "quantity": "sprinking"
      },
      {
        "item": "spinach",
        "quantity": "150g"
      },
      {
        "item": "lasagne sheets",
        "quantity": "10"
      },
      {
        "item": "vegan butter",
        "quantity": "35g"
      },
      {
        "item": "flour",
        "quantity": "4 tablespoons"
      },
      {
        "item": "soya milk",
        "quantity": "300ml"
      },
      {
        "item": "mustard",
        "quantity": "1.5 teaspoons"
      },
      {
        "item": "vinegar",
        "quantity": "1 teaspoon"
      }
    ]
  },
  {
    "name": "Bread omelette",
    "instructions": "Make and enjoy",
    "description": "Breakfast · Indian",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/hqaejl1695738653.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Bread",
        "quantity": "2"
      },
      {
        "item": "Egg",
        "quantity": "2"
      },
      {
        "item": "Salt",
        "quantity": "0.5"
      }
    ]
  },
  {
    "name": "Breakfast Potatoes",
    "instructions": "Before you do anything, freeze your bacon slices that way when you're ready to prep, it'll be so much easier to chop!\r\nWash the potatoes and cut medium dice into square pieces. To prevent any browning, place the already cut potatoes in a bowl filled with water.\r\nIn the meantime, heat 1-2 tablespoons of oil in a large skillet over medium-high heat. Tilt the skillet so the oil spreads evenly.\r\nOnce the oil is hot, drain the potatoes and add to the skillet. Season with salt, pepper, and Old Bay as needed.\r\nCook for 10 minutes, stirring the potatoes often, until brown. If needed, add a tablespoon more of oil.\r\nChop up the bacon and add to the potatoes. The bacon will start to render and the fat will begin to further cook the potatoes. Toss it up a bit! The bacon will take 5-6 minutes to crisp.\r\nOnce the bacon is cooked, reduce the heat to medium-low, add the minced garlic and toss. Season once more. Add dried or fresh parsley. Control heat as needed.\r\nLet the garlic cook until fragrant, about one minute.\r\nJust before serving, drizzle over the maple syrup and toss. Let that cook another minute, giving the potatoes a caramelized effect.\r\nServe in a warm bowl with a sunny side up egg!",
    "description": "Breakfast · Canadian",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/1550441882.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Potatoes",
        "quantity": "3 Medium"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 tbs"
      },
      {
        "item": "Bacon",
        "quantity": "2 strips"
      },
      {
        "item": "Garlic Clove",
        "quantity": "Minced"
      },
      {
        "item": "Maple Syrup",
        "quantity": "1 tbs"
      },
      {
        "item": "Parsley",
        "quantity": "Garnish"
      },
      {
        "item": "Salt",
        "quantity": "Pinch"
      },
      {
        "item": "Pepper",
        "quantity": "Pinch"
      },
      {
        "item": "Allspice",
        "quantity": "To taste"
      }
    ]
  },
  {
    "name": "Dutch poffertjes (mini pancakes)",
    "instructions": "Mix the dry yeast with some of the luke warm milk en stir until dissolved.\r\nPlace buckwheat and the flour together in a bowl and make a small circle in the middle. Add the yeast mixture into it. Add the milk and stir until you have a smooth batter.\r\nAdd the eggs, salt and vanille sugar and stir through. Leave to stand and rise for about 45 minutes.\r\nHeat the poffertjespan and add a bit of butter into each hole. Fill halfway with batter and first bake one side until you can see the top dry out a little. Turn the poffertjes around with a small fork and bake the other side until cooked and golden brown.\r\nServe the poffertjes with butter and icing sugar",
    "description": "Breakfast · Dutch",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/oaqz9f1766593912.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Flour",
        "quantity": "125g"
      },
      {
        "item": "Buckwheat Flour",
        "quantity": "125g"
      },
      {
        "item": "Eggs",
        "quantity": "2"
      },
      {
        "item": "Butter",
        "quantity": "1 knob"
      },
      {
        "item": "Milk",
        "quantity": "300ml"
      },
      {
        "item": "Yeast",
        "quantity": "10g"
      },
      {
        "item": "vanilla sugar",
        "quantity": "1tsp"
      },
      {
        "item": "Butter",
        "quantity": "To serve"
      },
      {
        "item": "Icing Sugar",
        "quantity": "To serve"
      }
    ]
  },
  {
    "name": "English Breakfast",
    "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
    "description": "Breakfast · British",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/utxryw1511721587.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Sausages",
        "quantity": "2"
      },
      {
        "item": "Bacon",
        "quantity": "3"
      },
      {
        "item": "Mushrooms",
        "quantity": "2"
      },
      {
        "item": "Tomatoes",
        "quantity": "2"
      },
      {
        "item": "Black Pudding",
        "quantity": "1 Slice"
      },
      {
        "item": "Eggs",
        "quantity": "2"
      },
      {
        "item": "Bread",
        "quantity": "1 Slice"
      }
    ]
  },
  {
    "name": "Fruit and Cream Cheese Breakfast Pastries",
    "instructions": "Preheat oven to 400ºF (200ºC), and prepare two cookie sheets with parchment paper. In a bowl, mix cream cheese, sugar, and vanilla until fully combined. Lightly flour the surface and roll out puff pastry on top to flatten. Cut each sheet of puff pastry into 9 equal squares. On the top right and bottom left of the pastry, cut an L shape approximately ½ inch (1 cm) from the edge.\r\nNOTE: This L shape should reach all the way down and across the square, however both L shapes should not meet at the ends. Your pastry should look like a picture frame with two corners still intact.\r\nTake the upper right corner and fold down towards the inner bottom corner. You will now have a diamond shape.\r\nPlace 1 to 2 teaspoons of the cream cheese filling in the middle, then place berries on top.\r\nRepeat with the remaining pastry squares and place them onto the parchment covered baking sheet.\r\nBake for 15-20 minutes or until pastry is golden brown and puffed.\r\nEnjoy!\r\n",
    "description": "Breakfast · American",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/1543774956.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Cream Cheese",
        "quantity": "1 1/4 oz"
      },
      {
        "item": "Sugar",
        "quantity": "1 1/4 cup"
      },
      {
        "item": "Vanilla Extract",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Flour",
        "quantity": ""
      },
      {
        "item": "Puff Pastry",
        "quantity": "2"
      },
      {
        "item": "Strawberries",
        "quantity": ""
      },
      {
        "item": "Raspberries",
        "quantity": ""
      },
      {
        "item": "Blackberries",
        "quantity": ""
      }
    ]
  },
  {
    "name": "Full English Breakfast",
    "instructions": "Heat the flat grill plate over a low heat, on top of 2 rings/flames if it fits, and brush sparingly with light olive oil.\r\nCook the sausages first. Add the sausages to the hot grill plate/the coolest part if there is one and allow to cook slowly for about 15-20 minutes, turning occasionally, until golden. After the first 10 minutes, increase the heat to medium before beginning to cook the other ingredients. If you are struggling for space, completely cook the sausages and keep hot on a plate in the oven.\r\nSnip a few small cuts into the fatty edge of the bacon. Place the bacon straight on to the grill plate and fry for 2-4 minutes each side or until your preferred crispiness is reached. Like the sausages, the cooked bacon can be kept hot on a plate in the oven.\r\nFor the mushrooms, brush away any dirt using a pastry brush and trim the stalk level with the mushroom top. Season with salt and pepper and drizzle over a little olive oil. Place stalk-side up on the grill plate and cook for 1-2 minutes before turning and cooking for a further 3-4 minutes. Avoid moving the mushrooms too much while cooking, as this releases the natural juices, making them soggy.\r\nFor the tomatoes, cut the tomatoes across the centre/or in half lengthways if using plum tomatoes , and with a small, sharp knife remove the green 'eye'. Season with salt and pepper and drizzle with a little olive oil. Place cut-side down on the grill plate and cook without moving for 2 minutes. Gently turn over and season again. Cook for a further 2-3 minutes until tender but still holding their shape.\r\nFor the black pudding, cut the black pudding into 3-4 slices and remove the skin. Place on the grill plate and cook for 1½-2 minutes each side until slightly crispy.\r\nFor 'proper' fried bread it's best to cook it in a separate pan. Ideally, use bread that is a couple of days old. Heat a frying pan to a medium heat and cover the base with oil. Add the bread and cook for 2-3 minutes each side until crispy and golden. If the pan becomes too dry, add a little more oil. For a richer flavour, add a knob of butter after you turn the slice.\r\nFor the fried eggs, break the egg straight into the pan with the fried bread and leave for 30 seconds. Add a good knob of butter and lightly splash/baste the egg with the butter when melted. Cook to your preferred stage, season and gently remove with a fish slice.\r\nOnce all the ingredients are cooked, serve on warm plates and enjoy straight away with a good squeeze of tomato ketchup or brown sauce.",
    "description": "Breakfast · British",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/sqrtwu1511721265.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Sausages",
        "quantity": "4"
      },
      {
        "item": "Bacon",
        "quantity": "4"
      },
      {
        "item": "Mushrooms",
        "quantity": "4"
      },
      {
        "item": "Tomatoes",
        "quantity": "3"
      },
      {
        "item": "Black Pudding",
        "quantity": "2 sliced"
      },
      {
        "item": "Eggs",
        "quantity": "2"
      },
      {
        "item": "Bread",
        "quantity": "1 Slice"
      },
      {
        "item": "Baked Beans",
        "quantity": "100g"
      }
    ]
  },
  {
    "name": "Home-made Mandazi",
    "instructions": "This is one recipe a lot of people have requested and I have tried to make it as simple as possible and I hope it will work for you. Make sure you use the right flour which is basically one with raising agents. Adjust the amount of sugar to your taste and try using different flavours to have variety whenever you have them.\r\nYou can use Coconut milk instead of regular milk, you can also add desiccated coconut to the dry flour or other spices like powdered cloves or cinnamon.\r\nFor “healthy looking” mandazis do not roll the dough too thin before frying and use the procedure I have indicated above.\r\n\r\n1. Mix the flour,cinnamon and sugar in a suitable bowl.\r\n2. In a separate bowl whisk the egg into the milk\r\n3. Make a well at the centre of the flour and add the milk and egg mixture and slowly mix to form a dough.\r\n4. Knead the dough for 3-4 minutes or until it stops sticking to the sides of the bowl and you have a smooth surface.\r\n5. Cover the dough with a damp cloth  and allow to rest for 15 minutes.\r\n6. Roll the dough on a lightly floured surface into a 1cm thick piece.\r\n7. Using a sharp small knife, cut the dough into the desired size setting aside ready for deep frying.\r\n8. Heat your oil in a suitable pot and gently dip the mandazi pieces to cook until light brown on the first side then turn to cook on the second side.\r\n9. Serve them warm or cold",
    "description": "Breakfast · Kenyan",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/thazgm1555350962.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Self-raising Flour",
        "quantity": "750g"
      },
      {
        "item": "Sugar",
        "quantity": "6 tablespoons"
      },
      {
        "item": "Eggs",
        "quantity": "2"
      },
      {
        "item": "Milk",
        "quantity": "1 cup"
      }
    ]
  },
  {
    "name": "Jamaican Cornmeal Porridge",
    "instructions": "Add 2 ½ cups water, 1 can coconut milk to a 4 QT heavy bottomed pot. Bring to a boil over medium-high heat.\r\nMeanwhile, add 1 cup cornmeal and 1 ½ cup water to a large mixing cup and whisk until smooth.\r\nOnce the pot begins to boil, whisk in cornmeal mixture and continue to whisk for about 1 minute, ensuring there are no lumps. Reduce heat to low and cover with a tight fitting lid.\r\nCook over low heat for 15-20 minutes, stirring occasionally. When there is about 5 minutes left, stir in vanilla extract, cinnamon, nutmeg, and all-spice. Remove from heat and sweeten with condensed milk.\r\nServe and enjoy.",
    "description": "Breakfast · Jamaican",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/sng9bm1765320170.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Water",
        "quantity": "4 cups"
      },
      {
        "item": "Coconut Milk",
        "quantity": "380g"
      },
      {
        "item": "Fine Yellow Cornmeal",
        "quantity": "1 cup"
      },
      {
        "item": "Vanilla Extract",
        "quantity": "1 1/2 tsp"
      },
      {
        "item": "Ground Cinnamon",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Ground Nutmeg",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Ground Allspice",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Sweetened Condensed Milk",
        "quantity": "1/2 cup"
      }
    ]
  },
  {
    "name": "Oatmeal pancakes",
    "instructions": "Place all the ingredients in the glass and beat.\r\nLet the mixture stand for 10 minutes.\r\nGrease a hot frying pan with a little butter and pour a little of the mixture.\r\nWhen it starts to bubble on the surface, turn over with a spatula. Cook over medium-low heat so that they do not burn.\r\nFinally, add the caramel and strawberries.",
    "description": "Breakfast · Venezulan",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/c400ok1764439058.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Egg",
        "quantity": "1 medium"
      },
      {
        "item": "Milk",
        "quantity": "80 ml"
      },
      {
        "item": "Sugar",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Baking Powder",
        "quantity": "1 tsp"
      },
      {
        "item": "Salt",
        "quantity": "Pinch"
      },
      {
        "item": "Vanilla Extract",
        "quantity": "1 dash"
      },
      {
        "item": "Ground Oats",
        "quantity": "150g"
      },
      {
        "item": "Butter",
        "quantity": "150g"
      },
      {
        "item": "Sugar Syrup",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Strawberries",
        "quantity": "3"
      }
    ]
  },
  {
    "name": "Rømmegrøt – Norwegian Sour Cream Porridge",
    "instructions": "▢\r\nCook the sour cream in a covered saucepan on medium heat for about 5 minutes.\r\n▢\r\nTurn down the heat and add half of the flour and stir well with a whisk. Once the flour is fully incorporated, let the mixture continue to cook, stirring occasionally, until fat starts to release. Use a spoon to gather as much of the fat as you can in a small bowl, saving for later. (Don't worry if you can't get any fat – in that case you can add butter later.)\r\n▢\r\nWhisk in the rest of the flour and then slowly add the milk, whisking constantly to avoid lumps. Let the porridge continue to cook on low heat for 5 minutes and then add salt.\r\n▢\r\nServe with sugar, cinnamon, and the fat from the porridge. If you're using lower fat sour cream you can top the rømmegrøt with some butter instead.",
    "description": "Breakfast · Norwegian",
    "category": "Breakfast",
    "image_url": "https://www.themealdb.com/images/media/meals/hyk47c1762772689.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Full fat sour cream",
        "quantity": "2 cups"
      },
      {
        "item": "Flour",
        "quantity": "3/4 cup"
      },
      {
        "item": "Milk",
        "quantity": "2 cups"
      },
      {
        "item": "Salt",
        "quantity": "1 tsp"
      },
      {
        "item": "Sugar",
        "quantity": "Sprinkling"
      },
      {
        "item": "Cinnamon",
        "quantity": "Sprinkling"
      },
      {
        "item": "Butter",
        "quantity": "To taste"
      }
    ]
  },
  {
    "name": "Æbleskiver",
    "instructions": "Whisk the flour, salt, sugar, baking soda, and cardamom together in a large bowl.\r\n▢\r\nSeparate the eggs and add the egg yolks to the flour mixture. Pour in the buttermilk (or cultured milk) and whisk the batter together until smooth. Cover and refrigerate for about 30 minutes.\r\n▢\r\nUse a hand (or stand) mixer to beat the egg whites until stiff. Carefully fold into the æbleskiver batter.\r\n▢\r\nHeat the pan on medium heat. Once hot, brush the pan with butter and fill each æbleskive hole almost full with the batter.\r\n▢\r\nOnce the edges become firm use a knitting needle or wooden skewer to turn the æbleskiver about 1/4. Continue turning until you get round pancake spheres. They should be golden brown.\r\n▢\r\nRemove the æbleskiver from the pan and serve with powdered sugar and jam.",
    "description": "Dessert · Norwegian",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/wkhg581762773124.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Flour",
        "quantity": "2 cups"
      },
      {
        "item": "Salt",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Granulated Sugar",
        "quantity": "2 tblsp"
      },
      {
        "item": "Baking Powder",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Cardamom",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Egg",
        "quantity": "3"
      },
      {
        "item": "Buttermilk",
        "quantity": "2 cups"
      },
      {
        "item": "Butter",
        "quantity": "For Greasing"
      },
      {
        "item": "Powdered Sugar",
        "quantity": "Sprinkling"
      },
      {
        "item": "Raspberry Jam",
        "quantity": "1 scoop"
      }
    ]
  },
  {
    "name": "Alfajores",
    "instructions": "Make the Dough: Cream butter and sugar. Add egg yolks and lemon zest. Gradually mix in flour and cornstarch to form a dough. Chill for 1 hour.\r\nBake the Cookies: Roll out the dough, cut into circles, and bake at 180°C (350°F) for 12-15 minutes. Let cool.\r\nAssemble: Spread dulce de leche on one cookie, then sandwich with another. Roll the edges in coconut flakes.\r\nPro Tips:\r\n\r\nChill the dough before rolling it out to make it easier to handle and to prevent the cookies from spreading too much while baking.\r\nDip the alfajores in melted chocolate and let them set on a wire rack for an extra decadent treat.",
    "description": "Dessert · Argentinian",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/a4kgf21763075288.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "All purpose flour",
        "quantity": "300g"
      },
      {
        "item": "Cornstarch",
        "quantity": "200g"
      },
      {
        "item": "Butter",
        "quantity": "200g"
      },
      {
        "item": "Sugar",
        "quantity": "100g"
      },
      {
        "item": "Egg Yolks",
        "quantity": "2"
      },
      {
        "item": "Lemon Zest",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Dulce de leche",
        "quantity": ""
      },
      {
        "item": "Desiccated Coconut",
        "quantity": "Sprinkling"
      }
    ]
  },
  {
    "name": "Anzac biscuits",
    "instructions": "step 1\r\nHeat oven to 180C/fan 160C/gas 4. Put the oats, coconut, flour and sugar in a bowl. Melt the butter in a small pan and stir in the golden syrup. Add the bicarbonate of soda to 2 tbsp boiling water, then stir into the golden syrup and butter mixture.\r\n\r\nstep 2\r\nMake a well in the middle of the dry ingredients and pour in the butter and golden syrup mixture. Stir gently to incorporate the dry ingredients.\r\n\r\nstep 3\r\nPut dessertspoonfuls of the mixture on to buttered baking sheets, about 2.5cm/1in apart to allow room for spreading. Bake in batches for 8-10 mins until golden. Transfer to a wire rack to cool.",
    "description": "Dessert · Australian",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/q47rkb1762324620.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Porridge oats",
        "quantity": "85g"
      },
      {
        "item": "Desiccated Coconut",
        "quantity": "85g"
      },
      {
        "item": "Plain Flour",
        "quantity": "100g"
      },
      {
        "item": "Caster Sugar",
        "quantity": "100g"
      },
      {
        "item": "Butter",
        "quantity": "100g"
      },
      {
        "item": "Golden Syrup",
        "quantity": "1 tblsp"
      },
      {
        "item": "Bicarbonate Of Soda",
        "quantity": "1 teaspoon"
      }
    ]
  },
  {
    "name": "Apam balik",
    "instructions": "Mix milk, oil and egg together. Sift flour, baking powder and salt into the mixture. Stir well until all ingredients are combined evenly.\r\n\r\nSpread some batter onto the pan. Spread a thin layer of batter to the side of the pan. Cover the pan for 30-60 seconds until small air bubbles appear.\r\n\r\nAdd butter, cream corn, crushed peanuts and sugar onto the pancake. Fold the pancake into half once the bottom surface is browned.\r\n\r\nCut into wedges and best eaten when it is warm.",
    "description": "Dessert · Malaysian",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/adxcbq1619787919.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Milk",
        "quantity": "200ml"
      },
      {
        "item": "Oil",
        "quantity": "60ml"
      },
      {
        "item": "Eggs",
        "quantity": "2"
      },
      {
        "item": "Flour",
        "quantity": "1600g"
      },
      {
        "item": "Baking Powder",
        "quantity": "3 tsp"
      },
      {
        "item": "Salt",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Unsalted Butter",
        "quantity": "25g"
      },
      {
        "item": "Sugar",
        "quantity": "45g"
      },
      {
        "item": "Peanut Butter",
        "quantity": "3 tbs"
      }
    ]
  },
  {
    "name": "Apple & Blackberry Crumble",
    "instructions": "Heat oven to 190C/170C fan/gas 5. Tip the flour and sugar into a large bowl. Add the butter, then rub into the flour using your fingertips to make a light breadcrumb texture. Do not overwork it or the crumble will become heavy. Sprinkle the mixture evenly over a baking sheet and bake for 15 mins or until lightly coloured.\r\nMeanwhile, for the compote, peel, core and cut the apples into 2cm dice. Put the butter and sugar in a medium saucepan and melt together over a medium heat. Cook for 3 mins until the mixture turns to a light caramel. Stir in the apples and cook for 3 mins. Add the blackberries and cinnamon, and cook for 3 mins more. Cover, remove from the heat, then leave for 2-3 mins to continue cooking in the warmth of the pan.\r\nTo serve, spoon the warm fruit into an ovenproof gratin dish, top with the crumble mix, then reheat in the oven for 5-10 mins. Serve with vanilla ice cream.",
    "description": "Dessert · British",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/xvsurr1511719182.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Plain Flour",
        "quantity": "120g"
      },
      {
        "item": "Caster Sugar",
        "quantity": "60g"
      },
      {
        "item": "Butter",
        "quantity": "60g"
      },
      {
        "item": "Braeburn Apples",
        "quantity": "300g"
      },
      {
        "item": "Butter",
        "quantity": "30g"
      },
      {
        "item": "Demerara Sugar",
        "quantity": "30g"
      },
      {
        "item": "Blackberries",
        "quantity": "120g"
      },
      {
        "item": "Cinnamon",
        "quantity": "¼ teaspoon"
      },
      {
        "item": "Ice Cream",
        "quantity": "to serve"
      }
    ]
  },
  {
    "name": "Apple cake",
    "instructions": "Preheat the oven to 180°C. (350˚F) Grease a cake pan and line it with baking paper.\r\nIn a large bowl, break the four eggs with the sugar and beat until they have tripled in volume and become fluffy.\r\nSift the self-rising baking flour and add it to your egg mixture. Fold this over, preserving as much air as possible. Add the melted (and slightly cooled) butter and mix until combined.\r\nAdd cinnamon, pinch of salt and vanilla extract.\r\nAdd the diced apple to the batter and gently fold them into the batter so that the apple pieces are evenly distributed. You can roll the apple pieces through some more cinnamon.\r\nPour the batter into the prepared cake pan and smooth the top with a spatula.\r\nPlace the apple slices on top of the batter and press lightly. Sprinkle optionally with some almond shavings.\r\nBake the apple cake in the preheated oven for about 45-50 minutes, or until a wooden skewer comes out clean when inserted into the center of the cake.\r\nRemove the cake from the oven and let it cool in the mold for a few minutes. Then carefully remove the cake from the mold and let cool completely on a wire rack.\r\nSprinkle the cooled apple cake with powdered sugar",
    "description": "Dessert · Dutch",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/c0gmo31766594751.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Eggs",
        "quantity": "4"
      },
      {
        "item": "Sugar",
        "quantity": "200g"
      },
      {
        "item": "Self-raising Flour",
        "quantity": "200g"
      },
      {
        "item": "Melted Butter",
        "quantity": "200g"
      },
      {
        "item": "Vanilla Extract",
        "quantity": "1 tsp"
      },
      {
        "item": "Ground Cinnamon",
        "quantity": "1 tsp"
      },
      {
        "item": "Apples",
        "quantity": "3"
      },
      {
        "item": "Salt",
        "quantity": "Pinch"
      },
      {
        "item": "Ground Sugar",
        "quantity": "Sprinkling"
      }
    ]
  },
  {
    "name": "Apple Frangipan Tart",
    "instructions": "Preheat the oven to 200C/180C Fan/Gas 6.\r\nPut the biscuits in a large re-sealable freezer bag and bash with a rolling pin into fine crumbs. Melt the butter in a small pan, then add the biscuit crumbs and stir until coated with butter. Tip into the tart tin and, using the back of a spoon, press over the base and sides of the tin to give an even layer. Chill in the fridge while you make the filling.\r\nCream together the butter and sugar until light and fluffy. You can do this in a food processor if you have one. Process for 2-3 minutes. Mix in the eggs, then add the ground almonds and almond extract and blend until well combined.\r\nPeel the apples, and cut thin slices of apple. Do this at the last minute to prevent the apple going brown. Arrange the slices over the biscuit base. Spread the frangipane filling evenly on top. Level the surface and sprinkle with the flaked almonds.\r\nBake for 20-25 minutes until golden-brown and set.\r\nRemove from the oven and leave to cool for 15 minutes. Remove the sides of the tin. An easy way to do this is to stand the tin on a can of beans and push down gently on the edges of the tin.\r\nTransfer the tart, with the tin base attached, to a serving plate. Serve warm with cream, crème fraiche or ice cream.",
    "description": "Dessert · British",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/wxywrq1468235067.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "digestive biscuits",
        "quantity": "175g/6oz"
      },
      {
        "item": "butter",
        "quantity": "75g/3oz"
      },
      {
        "item": "Bramley apples",
        "quantity": "200g/7oz"
      },
      {
        "item": "Salted Butter",
        "quantity": "75g/3oz"
      },
      {
        "item": "caster sugar",
        "quantity": "75g/3oz"
      },
      {
        "item": "free-range eggs, beaten",
        "quantity": "2"
      },
      {
        "item": "ground almonds",
        "quantity": "75g/3oz"
      },
      {
        "item": "almond extract",
        "quantity": "1 tsp"
      },
      {
        "item": "flaked almonds",
        "quantity": "50g/1¾oz"
      }
    ]
  },
  {
    "name": "Apricot & Turkish delight mess",
    "instructions": "step 1\r\nPlace the mascarpone, yogurt, sugar and orange flower water into a large bowl and whisk until thickened. Fold the remaining ingredients through, then divide the mix between 2 dessert glasses or bowls and decorate with extra mint, if you like.",
    "description": "Dessert · Turkish",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/p277uc1764109195.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Mascarpone",
        "quantity": "100g"
      },
      {
        "item": "Greek Yogurt",
        "quantity": "50g"
      },
      {
        "item": "Icing Sugar",
        "quantity": "25g"
      },
      {
        "item": "Orange Blossom Water",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Meringue Nests",
        "quantity": "1"
      },
      {
        "item": "Apricot",
        "quantity": "3"
      },
      {
        "item": "Turkish Delight",
        "quantity": "2 pieces"
      },
      {
        "item": "Almonds",
        "quantity": "25g"
      },
      {
        "item": "Mint",
        "quantity": "4"
      }
    ]
  },
  {
    "name": "Authentic Norwegian Kransekake",
    "instructions": "Grind almonds in an almond grinder or food processor.\r\n▢\r\nMix almonds and powdered sugar together in a large mixing bowl. Add three of the egg whites and knead the dough together with your hands until it comes together in a ball. Wrap in cling film and leave in the fridge for at least an hour, preferably until the next day.\r\n▢\r\nGrease the kransekake forms thoroughly and coat with semolina, flour, or bread crumbs.\r\n▢\r\nPreheat oven to 210°C (410°F) top and bottom heat. Divide the dough into six sections.\r\n▢\r\nSlowly add the remaining egg white to the dough and knead it until you can roll it into long sausages about as thick as your index finger. Fill the forms with the dough sausages, pinching the ends together to make rings.\r\n▢\r\nSet the forms on a baking sheet and back in the middle of the oven for about 10 – 12 minutes, until the tops are golden brown.",
    "description": "Dessert · Norwegian",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/yk78uc1763075719.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Almonds",
        "quantity": "3 Cups"
      },
      {
        "item": "Egg White",
        "quantity": "4"
      },
      {
        "item": "Powdered Sugar",
        "quantity": "4 cups"
      },
      {
        "item": "Powdered Sugar",
        "quantity": "2 cups"
      },
      {
        "item": "Egg White",
        "quantity": "1"
      },
      {
        "item": "Lemon Juice",
        "quantity": "1/2 teaspoon"
      }
    ]
  },
  {
    "name": "Bakewell tart",
    "instructions": "To make the pastry, measure the flour into a bowl and rub in the butter with your fingertips until the mixture resembles fine breadcrumbs. Add the water, mixing to form a soft dough.\r\nRoll out the dough on a lightly floured work surface and use to line a 20cm/8in flan tin. Leave in the fridge to chill for 30 minutes.\r\nPreheat the oven to 200C/400F/Gas 6 (180C fan).\r\nLine the pastry case with foil and fill with baking beans. Bake blind for about 15 minutes, then remove the beans and foil and cook for a further five minutes to dry out the base.\r\nFor the filing, spread the base of the flan generously with raspberry jam.\r\nMelt the butter in a pan, take off the heat and then stir in the sugar. Add ground almonds, egg and almond extract. Pour into the flan tin and sprinkle over the flaked almonds.\r\nBake for about 35 minutes. If the almonds seem to be browning too quickly, cover the tart loosely with foil to prevent them burning.",
    "description": "Dessert · British",
    "category": "Dessert",
    "image_url": "https://www.themealdb.com/images/media/meals/wyrqqq1468233628.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "plain flour",
        "quantity": "175g/6oz"
      },
      {
        "item": "chilled butter",
        "quantity": "75g/2½oz"
      },
      {
        "item": "cold water",
        "quantity": "2-3 tbsp"
      },
      {
        "item": "raspberry jam",
        "quantity": "1 tbsp"
      },
      {
        "item": "butter",
        "quantity": "125g/4½oz"
      },
      {
        "item": "caster sugar",
        "quantity": "125g/4½oz"
      },
      {
        "item": "ground almonds",
        "quantity": "125g/4½oz"
      },
      {
        "item": "free-range egg, beaten",
        "quantity": "1"
      },
      {
        "item": "almond extract",
        "quantity": "½ tsp"
      },
      {
        "item": "flaked almonds",
        "quantity": "50g/1¾oz"
      }
    ]
  },
  {
    "name": "Bean & Sausage Hotpot",
    "instructions": "In a large casserole, fry the sausages until brown all over – about 10 mins.\r\n\r\nAdd the tomato sauce, stirring well, then stir in the beans, treacle or sugar and mustard. Bring to the simmer, cover and cook for 30 mins. Great served with crusty bread or rice.",
    "description": "Miscellaneous · British",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/vxuyrx1511302687.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Sausages",
        "quantity": "8 large"
      },
      {
        "item": "Tomato Sauce",
        "quantity": "1 Jar"
      },
      {
        "item": "Butter Beans",
        "quantity": "1200g"
      },
      {
        "item": "Black Treacle",
        "quantity": "1 tbls"
      },
      {
        "item": "English Mustard",
        "quantity": "1 tsp"
      }
    ]
  },
  {
    "name": "Callaloo Jamaican Style",
    "instructions": "Cut leaves and soft stems from the kale branches, them soak in a bowl of cold water for about 5-10 minutes or until finish with prep.\r\nProceed to slicing the onions, mincing the garlic and dicing the tomatoes. Set aside\r\nRemove kale from water cut in chunks.\r\nPlace bacon on saucepan and cook until crispy. Then add onions, garlic, thyme, stir for about a minute or more\r\nAdd tomatoes; scotch bonnet pepper, smoked paprika. Sauté for about 2-3 more minutes.\r\nFinally add vegetable, salt, mix well, and steamed for about 6-8 minutes or until leaves are tender. Add a tiny bit of water as needed. Adjust seasonings and turn off the heat.\r\nUsing a sharp knife cut both ends off the plantain. This will make it easy to grab the skin of the plantains. Slit a shallow line down the long seam of the plantain; peel only as deep as the peel. Remove plantain peel by pulling it back.\r\nSlice the plantain into medium size lengthwise slices and set aside.\r\nCoat a large frying pan with cooking oil spray. Spray the tops of the plantains with a generous layer of oil spray and sprinkle with salt, freshly ground pepper.\r\nLet the plantains \"fry\" on medium heat, shaking the frying pan to redistribute them every few minutes.\r\nAs the plantains brown, continue to add more cooking oil spray, salt and pepper (if needed) until they have reached the desired color and texture.\r\nRemove and serve with kale",
    "description": "Miscellaneous · Jamaican",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/ussyxw1515364536.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Kale",
        "quantity": "1  bunch"
      },
      {
        "item": "Bacon",
        "quantity": "2 strips"
      },
      {
        "item": "Garlic",
        "quantity": "3 cloves Chopped"
      },
      {
        "item": "Onion",
        "quantity": "1 medium"
      },
      {
        "item": "Paprika",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Thyme",
        "quantity": "1 Sprig"
      },
      {
        "item": "Tomato",
        "quantity": "1"
      },
      {
        "item": "Red Pepper",
        "quantity": "1"
      },
      {
        "item": "Banana",
        "quantity": "4"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "Splash"
      }
    ]
  },
  {
    "name": "Chakchouka ",
    "instructions": "In a large cast iron skillet or sauté pan with a lid, heat oil over medium high heat. Add the onion and sauté for 2-3 minutes, until softened. Add the peppers and garlic, and sauté for an additional 3-5 minutes. Add the tomatoes, cumin, paprika, salt, and chili powder. Mix well and bring the mixture to a simmer. Reduce the heat to medium low and continue to simmer, uncovered, 10-15 minutes until the mixture has thickened to your desired consistency. (Taste the sauce at this point and adjust for salt and spice, as desired.) Using the back of a spoon, make four craters in the mixture, large enough to hold an egg. Crack one egg into each of the craters. Cover the skillet and simmer for 5-7 minutes, until the eggs have set. Serve immediately with crusty bread or pita.",
    "description": "Miscellaneous · Tunisian",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/gpz67p1560458984.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Tomatoes",
        "quantity": "4"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tbs"
      },
      {
        "item": "Onion",
        "quantity": "1 Diced"
      },
      {
        "item": "Red Pepper",
        "quantity": "1 sliced"
      },
      {
        "item": "Green Pepper",
        "quantity": "1 sliced"
      },
      {
        "item": "Garlic",
        "quantity": "3 Cloves Crushed"
      },
      {
        "item": "Cumin",
        "quantity": "1 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "1 tsp"
      },
      {
        "item": "Salt",
        "quantity": "3/4 teaspoon"
      },
      {
        "item": "Chili Powder",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Eggs",
        "quantity": "4"
      }
    ]
  },
  {
    "name": "Duck Confit",
    "instructions": "The day before you want to make the dish, scatter half the salt, half the garlic and half of the herbs over the base of a small shallow dish. Lay the duck legs, skin-side up, on top, then scatter over the remaining salt, garlic and herbs. Cover the duck and refrigerate overnight. This can be done up to 2 days ahead.\r\nPour the wine into a saucepan that will snugly fit the duck legs in a single layer. Brush the salt off the duck legs and place them, skin-side down, in the wine. Cover the pan with a lid and place over a medium heat. As soon as the wine starts to bubble, turn the heat down to the lowest setting and cook for 2 hours, checking occasionally that the liquid is just barely simmering. (If you own a heat diffuser, it would be good to use it here.) After 2 hours, the duck legs should be submerged in their own fat and the meat should feel incredibly tender when prodded. Leave to cool.\r\nThe duck legs are now cooked and can be eaten immediately – or you can follow the next step if you like them crisp. If you are preparing ahead, pack the duck legs tightly into a plastic container or jar and pour over the fat, but not the liquid at the bottom of the pan. Cover and leave in the fridge for up to a month, or freeze for up to 3 months. The liquid you are left with makes a tasty gravy, which can be chilled or frozen until needed.\r\nTo reheat and crisp up the duck legs, heat oven to 220C/fan 200C/gas 7. Remove the legs from the fat and place them, skin-side down, in an ovenproof frying pan. Roast for 30-40 mins, turning halfway through, until brown and crisp. Serve with the reheated gravy, a crisp salad and some crisp golden ptoatoes.",
    "description": "Miscellaneous · French",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/wvpvsu1511786158.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Sea Salt",
        "quantity": "Handful"
      },
      {
        "item": "Bay Leaf",
        "quantity": "4"
      },
      {
        "item": "Garlic",
        "quantity": "4 cloves"
      },
      {
        "item": "Thyme",
        "quantity": "Handful"
      },
      {
        "item": "Duck Legs",
        "quantity": "4"
      },
      {
        "item": "White Wine",
        "quantity": "100ml"
      }
    ]
  },
  {
    "name": "French Lentils With Garlic and Thyme",
    "instructions": "Place a large saucepan over medium heat and add oil. When hot, add chopped vegetables and sauté until softened, 5 to 10 minutes.\r\nAdd 6 cups water, lentils, thyme, bay leaves and salt. Bring to a boil, then reduce to a fast simmer.\r\nSimmer lentils until they are tender and have absorbed most of the water, 20 to 25 minutes. If necessary, drain any excess water after lentils have cooked. Serve immediately, or allow them to cool and reheat later.\r\nFor a fuller taste, use some chicken stock and reduce the water by the same amount.",
    "description": "Miscellaneous · French",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/vwwspt1487394060.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "3 tablespoons"
      },
      {
        "item": "Onion",
        "quantity": "1"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "item": "Carrots",
        "quantity": "1"
      },
      {
        "item": "French Lentils",
        "quantity": "2 1/4 cups"
      },
      {
        "item": "Thyme",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Bay Leaf",
        "quantity": "3"
      },
      {
        "item": "Salt",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Celery",
        "quantity": "2 sticks"
      }
    ]
  },
  {
    "name": "French Omelette",
    "instructions": "Get everything ready. Warm a 20cm (measured across the top) non-stick frying pan on a medium heat. Crack the eggs into a bowl and beat them with a fork so they break up and mix, but not as completely as you would for scrambled egg. With the heat on medium-hot, drop one knob of butter into the pan. It should bubble and sizzle, but not brown. Season the eggs with the Parmesan and a little salt and pepper, and pour into the pan.\r\nLet the eggs bubble slightly for a couple of seconds, then take a wooden fork or spatula and gently draw the mixture in from the sides of the pan a few times, so it gathers in folds in the centre. Leave for a few seconds, then stir again to lightly combine uncooked egg with cooked. Leave briefly again, and when partly cooked, stir a bit faster, stopping while there’s some barely cooked egg left. With the pan flat on the heat, shake it back and forth a few times to settle the mixture. It should slide easily in the pan and look soft and moist on top. A quick burst of heat will brown the underside.\r\nGrip the handle underneath. Tilt the pan down away from you and let the omelette fall to the edge. Fold the side nearest to you over by a third with your fork, and keep it rolling over, so the omelette tips onto a plate – or fold it in half, if that’s easier. For a neat finish, cover the omelette with a piece of kitchen paper and plump it up a bit with your fingers. Rub the other knob of butter over to glaze. Serve immediately.",
    "description": "Miscellaneous · French",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/yvpuuy1511797244.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Eggs",
        "quantity": "3"
      },
      {
        "item": "Butter",
        "quantity": "2 knobs"
      },
      {
        "item": "Parmesan",
        "quantity": "1 tsp"
      },
      {
        "item": "Tarragon Leaves",
        "quantity": "3 chopped"
      },
      {
        "item": "Parsley",
        "quantity": "1 tbs chopped"
      },
      {
        "item": "Chives",
        "quantity": "1 tbs chopped"
      },
      {
        "item": "Gruyère",
        "quantity": "4 tbs"
      }
    ]
  },
  {
    "name": "Locro",
    "instructions": "Soak: Soak corn and beans overnight in water.\r\nCook Meats: In a large pot, brown the beef and pork. Add onions and spices, cooking until translucent.\r\nSimmer the Stew: Add soaked corn and beans, pumpkin, potato, and enough water to cover. Simmer for 2-3 hours, until thick.\r\nServe: Enjoy hot, with bread on the side.\r\nPro Tips:\r\n\r\nToasting the corn slightly before adding it to the stew enhances its flavor.\r\nAdd a spoonful of paprika or a dash of cumin for an extra layer of warmth and complexity",
    "description": "Miscellaneous · Argentinian",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/5sgsob1763196284.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Dried white corn",
        "quantity": "500g"
      },
      {
        "item": "Dried white beans",
        "quantity": "200g"
      },
      {
        "item": "Pumpkin",
        "quantity": "300g"
      },
      {
        "item": "Potatoes",
        "quantity": "200g"
      },
      {
        "item": "Beef",
        "quantity": "300g"
      },
      {
        "item": "Pork",
        "quantity": "200g"
      },
      {
        "item": "Chorizo",
        "quantity": "1"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Paprika",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Salt",
        "quantity": "To taste"
      },
      {
        "item": "Pepper",
        "quantity": "To taste"
      }
    ]
  },
  {
    "name": "Migas",
    "instructions": "Crumble the bread into small pieces. Sprinkle with cold water, cover with a damp cloth and leave for 30 minutes.\r\nHeat 2 tsp of olive oil in a deep pan. Add the garlic cloves separated, skins on; just make a small cut with a knife to open them and keep frying for 5 minutes. Set the garlic aside.\r\nIn the same oil, where we fried everything, simmer the bread, stirring constantly for 15 minutes and add a grinding of black pepper.\r\nAdd the garlic, continue stirring for about 20 minutes. It will be ready when the bread is soft and golden.",
    "description": "Miscellaneous · Spanish",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/xd9aj21740432378.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Bread",
        "quantity": "1 large"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 1/2 L"
      },
      {
        "item": "Garlic",
        "quantity": "Half"
      },
      {
        "item": "Pork",
        "quantity": "1 Handfull"
      }
    ]
  },
  {
    "name": "Mutabbaq",
    "instructions": "1\r\nHeat the frying pan and add in some oil. Fry the mashed garlic and ginger first and then add in the minced meat and all seasoning. When the meat is cooked, set aside to cool down.\r\n2\r\nGet another big bowl. Add in egg, chopped tomato, chopped spring onion and minced meat.\r\n3\r\nGet one 2 sheets of filo pastry or 1 sheet spring roll wrap. Brush it with some butter and then put some filling in the middle. Fold the pastry and brush more butter on the seal part.\r\n4\r\nHeat a frying pan and add in some oil to cook the parcel until its both sides and 4 edges all turn into golden brown. (Or brush melted butter all over the parcel and bake it in 180°C oven for 10-15 minutes)\r\n5\r\nEnjoy \r\n\r\n",
    "description": "Miscellaneous · Saudi Arabian",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/i5o2b61763739053.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Mincemeat",
        "quantity": "500g"
      },
      {
        "item": "Garlic",
        "quantity": "1.5 tbs minced"
      },
      {
        "item": "Ginger",
        "quantity": "1.5 tbs minced"
      },
      {
        "item": "Egg",
        "quantity": "1"
      },
      {
        "item": "Tomato",
        "quantity": "1 large"
      },
      {
        "item": "Spring Onions",
        "quantity": "4"
      },
      {
        "item": "Filo Pastry",
        "quantity": "12"
      },
      {
        "item": "Melted Butter",
        "quantity": "1 1/2 cups"
      },
      {
        "item": "Salt",
        "quantity": "1 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "1 tsp"
      },
      {
        "item": "Cumin",
        "quantity": "1 tsp"
      },
      {
        "item": "Allspice",
        "quantity": "1 tsp"
      },
      {
        "item": "Turmeric",
        "quantity": "1 tsp"
      },
      {
        "item": "Black Pepper",
        "quantity": "1 tsp"
      },
      {
        "item": "Sugar",
        "quantity": "1 tsp"
      }
    ]
  },
  {
    "name": "Osso Buco alla Milanese",
    "instructions": "Heat the oven to 300 degrees.\r\nDredging the shanks: pour the flour into a shallow dish (a pie plate works nicely). Season the veal shanks on all sides with salt and pepper. One at a time, roll the shanks around in the flour coat, and shake and pat the shank to remove any excuses flour. Discard the remaining flour.\r\nBrowning the shanks: put the oil and 1 tablespoon of the butter in a wide Dutch oven or heavy braising pot (6 to 7 quart) and heat over medium-high heat. When the butter has melted and the oil is shimmering, lower the shanks into the pot, flat side down; if the shanks won’t fit without touching one another, do this in batches. Brown the shanks, turning once with tongs, until both flat sides are well caramelized, about 5 minutes per side. If the butter-oil mixture starts to burn, lower the heat just a bit. Transfer the shanks to a large platter or tray and set aside.\r\nThe aromatics: pour off and discard the fat from the pot. Wipe out any burnt bits with a damp paper towel, being careful not to remove any delicious little caramelized bits. Ad the remaining 2 tablespoons butter to the pot and melt it over medium heat. When the butter has stopped foaming, add the onion, carrot, celery, and fennel. Season with salt and pepper, stir, and cook the vegetables until they begin to soften but do not brown, about 6 minutes. Stir in the garlic, orange zest, marjoram, and bay leaf, and stew for another minute or two.\r\nThe braising liquid: add the wine, increase the heat to high, and bring to a boil. Boil, stirring occasionally, to reduce the wine by about half, 5 minutes. Add the stock and tomatoes, with their juice, and boil again to reduce the liquid to about 1 cup total, about 10 minutes.\r\nThe braise: Place the shanks in the pot so that they are sitting with the exposed bone facing up, and pour over any juices that accumulated as they sat. Cover with parchment paper, pressing down so the parchment nearly touches the veal and the edges hang over the sides of the pot by about an inch. Cover tightly with the lid, and slide into the lower part of the oven to braise at a gentle simmer. Check the pot after the first 15 minutes, and if the liquid is simmering too aggressively, lower the oven heat by 10 or 15 degrees. Continue braising, turning the shanks and spooning some pan juices over the top after the first 40 minutes, until the meat is completely tender and pulling away from the bone, about 2 hours.\r\nThe gremolata: While the shanks are braising, stir together the garlic, parsley, and lemon zest in a small bowl. Cover with plastic wrap and set aside in a cool place (or the refrigerator, if your kitchen is very warm.)\r\nThe finish: When the veal is fork-tender and falling away from the bone, remove the lid and sprinkle over half of the gremolata. Return the veal to the oven, uncovered, for another 15 minutes to caramelize it some.\r\nUsing a slotted spatula or spoon, carefully lift the shanks from the braising liquid, doing your best to keep them intact. The shanks will be very tender and threatening to fall into pieces, and the marrow will be wobbly inside the bones, so this can be a bit tricky. But if they do break apart, don’t worry, the flavor won’t suffer at all. Arrange the shanks on a serving platter or other large plate, without stacking, and cover with foil to keep warm.\r\nFinishing the sauce: Set the braising pot on top of the stove and evaluate the sauce: if there is a visible layer of fat floating on the surface, use a large spoon to skim it off and discard it. Taste the sauce for concentration of flavor. If it tastes a bit weak or flat, bring it to a boil over high heat, and boil to reduce the volume and intensify the flavor for 5 to 10 minutes. Taste again for salt and pepper. If the sauce wants more zip, stir in a teaspoon or two of the remaining gremolata.\r\nPortioning the veal shanks: if the shanks are reasonably sized, serve one per person. If the shanks are gargantuan or you’re dealing with modest appetites, pull apart the larger shanks, separating them at their natural seams, and serve smaller amounts. Be sure to give the marrow bones to whomever prizes them most.\r\nServing: Arrange the veal shanks on warm dinner plates accompanied by the risotto, if serving. Just before carrying the plates to the table, sprinkle on the remaining gremolata and then spoon over a generous amount of sauce – the contact with the hot liquid will aromatize the gremolata and perk up everyone’s appetite with the whiff of garlic and lemon.",
    "description": "Miscellaneous · Italian",
    "category": "Miscellaneous",
    "image_url": "https://www.themealdb.com/images/media/meals/wwuqvt1487345467.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Veal",
        "quantity": "4 meaty shanks"
      },
      {
        "item": "Flour",
        "quantity": "½ cup"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Butter",
        "quantity": "3 tablespoons"
      },
      {
        "item": "Onion",
        "quantity": "1 medium chopped into ½-inch pieces"
      },
      {
        "item": "Carrots",
        "quantity": "1 chopped into ½-inch pieces"
      },
      {
        "item": "Celery",
        "quantity": "1 chopped into ½-inch pieces"
      },
      {
        "item": "Fennel",
        "quantity": "1 bulb chopped into ½-inch pieces"
      },
      {
        "item": "Garlic",
        "quantity": "3 cloves"
      },
      {
        "item": "Orange Zest",
        "quantity": "2 strips"
      },
      {
        "item": "Marjoram",
        "quantity": "1 ½ teaspoons"
      },
      {
        "item": "Bay Leaf",
        "quantity": "1"
      },
      {
        "item": "Dry White Wine",
        "quantity": "1 cup"
      },
      {
        "item": "Chicken Stock",
        "quantity": "½ cup"
      },
      {
        "item": "Tomatoes",
        "quantity": "1 cup chopped with juice"
      },
      {
        "item": "Parsley",
        "quantity": "2 tablespoons chopped"
      },
      {
        "item": "Garlic",
        "quantity": "1 teaspoon minced"
      },
      {
        "item": "Lemon Zest",
        "quantity": "1 teaspoon grated"
      }
    ]
  },
  {
    "name": " Bubble & Squeak",
    "instructions": "Melt the fat in a non-stick pan, allow it to get nice and hot, then add the bacon. As it begins to brown, add the onion and garlic. Next, add the sliced sprouts or cabbage and let it colour slightly. All this will take 5-6 mins.\r\nNext, add the potato. Work everything together in the pan and push it down so that the mixture covers the base of the pan – allow the mixture to catch slightly on the base of the pan before turning it over and doing the same again. It’s the bits of potato that catch in the pan that define the term ‘bubble and squeak’, so be brave and let the mixture colour. Cut into wedges and serve.",
    "description": "Pork · British",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/xusqvw1511638311.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Butter",
        "quantity": "1 tbs"
      },
      {
        "item": "Bacon",
        "quantity": "4"
      },
      {
        "item": "Onion",
        "quantity": "1 finely sliced"
      },
      {
        "item": "Garlic Clove",
        "quantity": "1 chopped"
      },
      {
        "item": "Brussels Sprouts",
        "quantity": "20"
      },
      {
        "item": "Potatoes",
        "quantity": "400g"
      }
    ]
  },
  {
    "name": "Arroz al horno (baked rice)",
    "instructions": "step 1\r\nHeat oven to 200C/180C/gas 6. Heat half the oil in a deep frying or sauté pan (or shallow casserole dish) measuring around 30cm in diameter. Over a high heat, colour the pork belly slices on each side in several batches, then transfer to a bowl. Add the remaining oil to the pan and lower the heat to medium, then add the black pudding and bacon and fry all over for several mins. Remove with a slotted spoon. Fry the onion and peppers for around 10 mins until soft and pale gold, then add the tomato and cook until soft. Add the garlic, smoked paprika and chilli flakes and cook for another 2 mins, then put the pork, black pudding and bacon back in the pan. Add the beans, stock and whichever herb you're using, and bring everything to the boil.\r\n\r\nstep 2\r\nSprinkle the rice around the pork belly, pushing it underneath the stock. Let the stock come to the boil again, season well, then transfer to the oven (leave it uncovered). Cook for 20 mins without stirring, then check to see how the rice is doing. The rice should be tender and the stock absorbed. If it’s not ready, put back in the oven for another 5 mins, then check again. Taste for seasoning.\r\n\r\nstep 3\r\nSqueeze lemon juice over the top and drizzle over some extra virgin olive oil just before serving, if you like.",
    "description": "Pork · Spanish",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/qt4i0n1763256454.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Extra Virgin Olive Oil",
        "quantity": "2 tbsp"
      },
      {
        "item": "Pork belly slices",
        "quantity": "800g"
      },
      {
        "item": "Black Pudding",
        "quantity": "150g"
      },
      {
        "item": "Bacon lardon",
        "quantity": "100g"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Red Pepper",
        "quantity": "2"
      },
      {
        "item": "Plum Tomatoes",
        "quantity": "1 chopped"
      },
      {
        "item": "Garlic Clove",
        "quantity": "8"
      },
      {
        "item": "Paprika",
        "quantity": "4 teaspoons"
      },
      {
        "item": "Chilli Flakes",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Dried white beans",
        "quantity": "200g"
      },
      {
        "item": "Chicken Stock",
        "quantity": "1 1/2 L"
      },
      {
        "item": "Thyme",
        "quantity": "6 parts"
      },
      {
        "item": "Paella Rice",
        "quantity": "375g"
      },
      {
        "item": "Lemon Juice",
        "quantity": "1"
      }
    ]
  },
  {
    "name": "Barbecue pork buns",
    "instructions": "step 1\r\nHeat the oven to 200C/fan 180C/gas. Mix the sugar into the bread mix in a large bowl, then add water as instructed on the pack. Bring the dough together with a wooden spoon, then knead on a lightly floured surface for 5 mins until smooth. Put into a large bowl, cover with oiled cling film then leave in a warm place until doubled in size.\r\n\r\nstep 2\r\nMeanwhile, heat the oil in a pan, then fry the bacon until crisp, about 5 mins. Add the ginger and garlic and fry for 1 min until soft, then tip in the soy, honey and tomato purée and stir well. Can be made up to 3 days ahead.\r\n\r\nstep 3\r\nTurn out the dough and knead briefly, then pull into 12 even-sized balls. Flatten with your hands, then put a teaspoon-size blob of the filling in the middle. Draw the dough up and pinch it closed like a purse, then turn the bun over and sit it on a large baking sheet. Cover with oiled cling film and leave to rise for about 30 mins until the dough feels pillowy. Brush with egg and bake for 20 mins until golden. Serve warm with dipping sauce. Can be frozen after second rise for up to 1 month or baked up to a day ahead and re-warmed.",
    "description": "Pork · Vietnamese",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/tzsy461763769901.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Sugar",
        "quantity": "85g"
      },
      {
        "item": "White Bread Mix",
        "quantity": "500g"
      },
      {
        "item": "Sunflower Oil",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Bacon",
        "quantity": "12"
      },
      {
        "item": "Ginger",
        "quantity": "Knob"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "item": "Soy Sauce",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Clear Honey",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Tomato Puree",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Egg",
        "quantity": "1 beaten"
      }
    ]
  },
  {
    "name": "BBQ Pork Sloppy Joes",
    "instructions": "1\r\n\r\nPreheat oven to 450 degrees. Wash and dry all produce. Cut sweet potatoes into ½-inch-thick wedges. Toss on a baking sheet with a drizzle of oil, salt, and pepper. Roast until browned and tender, 20-25 minutes.\r\n\r\n2\r\n\r\nMeanwhile, halve and peel onion. Slice as thinly as possible until you have ¼ cup (½ cup for 4 servings); finely chop remaining onion. Peel and finely chop garlic. Halve lime; squeeze juice into a small bowl. Halve buns. Add 1 TBSP butter (2 TBSP for 4) to a separate small microwave-safe bowl; microwave until melted, 30 seconds. Brush onto cut sides of buns.\r\n\r\n3\r\n\r\nTo bowl with lime juice, add sliced onion, ¼ tsp sugar (½ tsp for 4 servings), and a pinch of salt. Stir to combine; set aside to quick-pickle.\r\n\r\n4\r\n\r\nHeat a drizzle of oil in a large pan over medium-high heat. Add chopped onion and season with salt and pepper. Cook, stirring, until softened, 4-5 minutes. Add garlic and cook until fragrant, 30 seconds more. Add pork and season with salt and pepper. Cook, breaking up meat into pieces, until browned and cooked through, 4-6 minutes.\r\n\r\n5\r\n\r\nWhile pork cooks, in a third small bowl, combine BBQ sauce, pickling liquid from onion, 3 TBSP ketchup (6 TBSP for 4 servings), ½ tsp sugar (1 tsp for 4), and ¼ cup water (⅓ cup for 4). Once pork is cooked through, add BBQ sauce mixture to pan. Cook, stirring, until sauce is thickened, 2-3 minutes. Taste and season with salt and pepper.\r\n\r\n6\r\n\r\nMeanwhile, toast buns in oven or toaster oven until golden, 3-5 minutes. Divide toasted buns between plates and fill with as much BBQ pork as you’d like. Top with pickled onion and hot sauce. Serve with sweet potato wedges on the side.",
    "description": "Pork · American",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/atd5sh1583188467.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Potatoes",
        "quantity": "2"
      },
      {
        "item": "Red Onions",
        "quantity": "1"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves"
      },
      {
        "item": "Lime",
        "quantity": "1"
      },
      {
        "item": "Bread",
        "quantity": "2"
      },
      {
        "item": "Pork",
        "quantity": "1 lb"
      },
      {
        "item": "Barbeque Sauce",
        "quantity": ""
      },
      {
        "item": "Hotsauce",
        "quantity": ""
      },
      {
        "item": "Tomato Ketchup",
        "quantity": ""
      },
      {
        "item": "Sugar",
        "quantity": ""
      },
      {
        "item": "Vegetable Oil",
        "quantity": ""
      },
      {
        "item": "Salt",
        "quantity": ""
      },
      {
        "item": "Pepper",
        "quantity": ""
      }
    ]
  },
  {
    "name": "Bigos (Hunters Stew)",
    "instructions": "Preheat the oven to 350 degrees F (175 degrees C).\r\n\r\nHeat a large pot over medium heat. Add the bacon and kielbasa; cook and stir until the bacon has rendered its fat and sausage is lightly browned. Use a slotted spoon to remove the meat and transfer to a large casserole or Dutch oven.\r\n\r\nCoat the cubes of pork lightly with flour and fry them in the bacon drippings over medium-high heat until golden brown. Use a slotted spoon to transfer the pork to the casserole. Add the garlic, onion, carrots, fresh mushrooms, cabbage and sauerkraut. Reduce heat to medium; cook and stir until the carrots are soft, about 10 minutes. Do not let the vegetables brown.\r\n\r\nDeglaze the pan by pouring in the red wine and stirring to loosen all of the bits of food and flour that are stuck to the bottom. Season with the bay leaf, basil, marjoram, paprika, salt, pepper, caraway seeds and cayenne pepper; cook for 1 minute.\r\n\r\nMix in the dried mushrooms, hot pepper sauce, Worcestershire sauce, beef stock, tomato paste and tomatoes. Heat through just until boiling. Pour the vegetables and all of the liquid into the casserole dish with the meat. Cover with a lid.\r\n\r\nBake in the preheated oven for 2 1/2 to 3 hours, until meat is very tender.",
    "description": "Pork · Polish",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/md8w601593348504.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Bacon",
        "quantity": "2 sliced"
      },
      {
        "item": "Kielbasa",
        "quantity": "1 lb"
      },
      {
        "item": "Pork",
        "quantity": "1 lb"
      },
      {
        "item": "Flour",
        "quantity": "1/4 cup"
      },
      {
        "item": "Garlic",
        "quantity": "3 chopped"
      },
      {
        "item": "Onion",
        "quantity": "1 Diced"
      },
      {
        "item": "Mushrooms",
        "quantity": "1 1/2 cup"
      },
      {
        "item": "Cabbage",
        "quantity": "4 cups"
      },
      {
        "item": "Sauerkraut",
        "quantity": "1 Jar"
      },
      {
        "item": "Red Wine",
        "quantity": "1/4 cup"
      },
      {
        "item": "Bay Leaf",
        "quantity": "1"
      },
      {
        "item": "Basil",
        "quantity": "1 tsp"
      },
      {
        "item": "Marjoram",
        "quantity": "1 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "1 tbs"
      },
      {
        "item": "Caraway Seed",
        "quantity": "1/8 teaspoon"
      },
      {
        "item": "Hotsauce",
        "quantity": "1 dash"
      },
      {
        "item": "Beef Stock",
        "quantity": "5 Cups"
      },
      {
        "item": "Tomato Puree",
        "quantity": "2 tbs"
      },
      {
        "item": "Diced Tomatoes",
        "quantity": "1 cup"
      },
      {
        "item": "Worcestershire Sauce",
        "quantity": "1 dash"
      }
    ]
  },
  {
    "name": "Boxty Breakfast",
    "instructions": "STEP 1\r\nBefore you start, put your oven on its lowest setting, ready to keep things warm. Peel the potatoes, grate 2 of them, then set aside. Cut the other 2 into large chunks, then boil for 10-15 mins or until tender. Meanwhile, squeeze as much of the liquid from the grated potatoes as you can using a clean tea towel. Mash the boiled potatoes, then mix with the grated potato, spring onions and flour.\r\n\r\nSTEP 2\r\nWhisk the egg white in a large bowl until it holds soft peaks. Fold in the buttermilk, then add the bicarbonate of soda. Fold into the potato mix.\r\n\r\nSTEP 3\r\nHeat a large non-stick frying pan over a medium heat, then add 1 tbsp butter and some of the oil. Drop 3-4 spoonfuls of the potato mixture into the pan, then gently cook for 3-5 mins on each side until golden and crusty. Keep warm on a plate in the oven while you cook the next batch, adding more butter and oil to the pan before you do so. You will get 16 crumpet-size boxty from the mix. Can be made the day ahead, drained on kitchen paper, then reheated in a low oven for 20 mins.\r\n\r\nSTEP 4\r\nHeat the grill to medium and put the tomatoes in a heavy-based pan. Add a good knob of butter and a little oil, then fry for about 5 mins until softened. Grill the bacon, then pile onto a plate and keep warm. Stack up the boxty, bacon and egg, and serve the tomatoes on the side.",
    "description": "Pork · Irish",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/naqyel1608588563.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Potatoes",
        "quantity": "4 large"
      },
      {
        "item": "Spring Onions",
        "quantity": "1  bunch"
      },
      {
        "item": "Plain Flour",
        "quantity": "100g"
      },
      {
        "item": "Egg White",
        "quantity": "1"
      },
      {
        "item": "Milk",
        "quantity": "150ml"
      },
      {
        "item": "Bicarbonate Of Soda",
        "quantity": "1 tsp"
      },
      {
        "item": "Butter",
        "quantity": "3 tbs"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "2 tbs"
      },
      {
        "item": "Cherry Tomatoes",
        "quantity": "6"
      },
      {
        "item": "Bacon",
        "quantity": "12"
      },
      {
        "item": "Egg",
        "quantity": "6"
      }
    ]
  },
  {
    "name": "Bryndzové Halušky",
    "instructions": "1. Prepare the Dough\r\nGrate the potatoes finely using a hand grater or food processor. Place the grated potatoes in a bowl and mix them with flour, egg, and salt until a sticky dough forms. The consistency should be thick but pliable.\r\n\r\n2. Cook the Dumplings\r\nBring a large pot of salted water to a boil. Using a halušky maker (similar to a spaetzle maker), press the dough directly into the boiling water. If you don’t have one, use a tilted cutting board and a knife to scrape small pieces of dough into the water.\r\n\r\nLet the dumplings cook until they float to the surface, usually within 2-3 minutes. Scoop them out with a slotted spoon and set aside in a large bowl.\r\n\r\n3. Prepare the Toppings\r\nChop the bacon into small pieces and fry in a skillet over medium heat until crispy. If using a bryndza substitute, mix crumbled feta with a dollop of sour cream to mimic the tangy flavour of traditional Slovak sheep cheese.\r\n\r\n4. Assemble the Dish\r\nToss the cooked dumplings with the bryndza cheese (or substitute) until they’re well-coated and creamy. Top with the crispy bacon and its drippings. Garnish with chopped chives or parsley for an extra touch of colour and flavour.",
    "description": "Pork · Slovakian",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/g33c901763365484.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Potatoes",
        "quantity": "500g"
      },
      {
        "item": "Plain Flour",
        "quantity": "200g"
      },
      {
        "item": "Egg",
        "quantity": "1"
      },
      {
        "item": "Salt",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Bryndza cheese",
        "quantity": "250g"
      },
      {
        "item": "Bacon",
        "quantity": "200g"
      },
      {
        "item": "Chives",
        "quantity": "Garnish"
      }
    ]
  },
  {
    "name": "Cassava pizza",
    "instructions": "Preheat the oven to 200ºC.\r\nCut the bacon or chorizo into medium pieces and the paprika into strips.\r\nSpread a little tomato sauce and mozzarella cheese on each portion of cassava.\r\nAdd the bacon or chorizo, corn, turkey ham, some olives and paprika.\r\nBake for 7 to 10 minutes.\r\nRemove from the oven and enjoy.",
    "description": "Pork · Venezulan",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/lrfdwz1764438393.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Casabe",
        "quantity": "6 cut thick slices"
      },
      {
        "item": "Tomato Sauce",
        "quantity": "450g"
      },
      {
        "item": "Chorizo",
        "quantity": "225g"
      },
      {
        "item": "Turkey Ham",
        "quantity": "225g"
      },
      {
        "item": "Sweetcorn",
        "quantity": "75g"
      },
      {
        "item": "Green Olives",
        "quantity": "40g"
      },
      {
        "item": "Paprika",
        "quantity": "55g"
      },
      {
        "item": "Mozzarella",
        "quantity": "50g"
      }
    ]
  },
  {
    "name": "Chickpea, chorizo & spinach stew",
    "instructions": "step 1\r\nHeat the oil in a large pan, then gently fry the onion for 3-4 mins until it begins to soften. Stir in the carrot, celery, thyme and bay leaves. Season, then cook for 2-3 mins, stirring occasionally. Add the garlic, chorizo, cinnamon and smoked paprika. Gently fry until the vegetables soften and the chorizo starts to release its oils and crisp up.\r\n\r\nstep 2\r\nStir in the chickpeas, vinegar and 150ml water, then bring to a simmer for 1-2 mins until the chickpeas have heated up. Add the spinach, then stir through the chickpeas until it wilts a little. Remove from the heat, season to taste, then serve warm with crusty bread.",
    "description": "Pork · Spanish",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/xvnx8j1763287209.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Extra Virgin Olive Oil",
        "quantity": "4 tablespoons"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Carrots",
        "quantity": "1 Diced"
      },
      {
        "item": "Celery",
        "quantity": "1 Diced"
      },
      {
        "item": "Thyme",
        "quantity": "3"
      },
      {
        "item": "Bay Leaves",
        "quantity": "2"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "item": "Chorizo",
        "quantity": "200g"
      },
      {
        "item": "Cinnamon",
        "quantity": "1/4 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "1 teaspoon"
      },
      {
        "item": "Chickpeas",
        "quantity": "800g"
      },
      {
        "item": "Sherry vinegar",
        "quantity": "2 tblsp"
      },
      {
        "item": "Spinach",
        "quantity": "400g"
      }
    ]
  },
  {
    "name": "Choripán",
    "instructions": "Grill the Chorizos: Cook the chorizos on a grill or pan until fully cooked, about 10-15 minutes.\r\nPrepare the Rolls: Slice the rolls and toast them lightly on the grill or in a pan.\r\nAssemble: Slice each chorizo lengthwise and place in a roll. Top with a generous amount of chimichurri sauce.\r\nServe: Enjoy immediately while hot.\r\nPro Tips:\r\n\r\nGrill the chorizo slowly on medium heat to prevent the skin from bursting and to ensure it cooks evenly throughout.\r\nToast the bread on the grill to absorb some of the chorizo's flavors.",
    "description": "Pork · Argentinian",
    "category": "Pork",
    "image_url": "https://www.themealdb.com/images/media/meals/5i25sg1763075353.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Chorizo",
        "quantity": "4"
      },
      {
        "item": "Crusty Bread",
        "quantity": "4"
      },
      {
        "item": "Chimichurri sauce",
        "quantity": "Drizzle"
      }
    ]
  },
  {
    "name": "Adana kebab",
    "instructions": "step 1\r\nFinely chop the peppers in a food processor, then tip them in a sieve and press into the sieve so that the peppers release all of their juices. Tip into a bowl along with the mince, red pepper paste, pul biber, 1½ tsp flaky sea salt, and 2 tbsp of the oil. Mix together, kneading well for at least 2-3 mins. If you need to, wet your hands with cold water to prevent the mixture from sticking. The mixture should be sticky when ready. Cover and chill for at least 2 hrs, or up to 12 hrs.\r\n\r\nstep 2\r\nWhen ready to cook, heat the grill to high or an oven to 220C/200C fan/gas 6. Divide the mixture into 12 equal portions, around 85g each. If you’d like to skewer them, divide into 8 equal portions and roll into balls. Using wet hands, thread the balls onto the end of the skewers, massaging the mixture down the skewers in between the palms of your hands, until evenly distributed. Ensure that the mixture is fully wrapped tightly around the skewers without any exposed metal. Alternatively, lay them on a large baking tray lined with parchment paper if cooking in the oven, or foil if cooking under the grill. Shape into 20cm-long köfte. Wet your fingers with a little cold water and make indents all along the köfte for the traditional shape.\r\n\r\nstep 3\r\nGently brush each köfte with the remaining 1 tbsp oil and cook under the grill, on the top shelf for 10-12 mins, turning regularly, or cook in the oven for 16-18 mins, until crispy on the outside and juicy in the middle",
    "description": "Lamb · Turkish",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/04axct1763793018.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Romano Pepper",
        "quantity": "2 large"
      },
      {
        "item": "Lamb Mince",
        "quantity": "800g"
      },
      {
        "item": "Red Pepper Paste",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Pul Biber",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Sunflower Oil",
        "quantity": "3  tablespoons"
      }
    ]
  },
  {
    "name": "Chilli ginger lamb chops",
    "instructions": "step 1\r\nPut the garlic in a bowl with the ginger, lemon juice, oil, spices and seasoning. Blitz with a hand blender until smooth, then use to coat the lamb chops on both sides. Leave to marinate in the fridge for a couple of hours or overnight.\r\n\r\nstep 2\r\nHeat a barbecue until hot. Barbecue the chops over the coals for 3 mins on each side until cooked but still pink and juicy in the centre.",
    "description": "Lamb · Turkish",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/8xuvhj1763794991.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Garlic",
        "quantity": "4 Cloves Crushed"
      },
      {
        "item": "Ginger",
        "quantity": "1 tblsp"
      },
      {
        "item": "Lemon Juice",
        "quantity": "1 tblsp"
      },
      {
        "item": "Olive Oil",
        "quantity": "1 tblsp"
      },
      {
        "item": "Chili Powder",
        "quantity": "1/2 tsp"
      },
      {
        "item": "Cumin",
        "quantity": "1 tsp"
      },
      {
        "item": "Lamb Loin Chops",
        "quantity": "8"
      }
    ]
  },
  {
    "name": "Chorba Hamra bel Frik (Algerian Lamb, Tomato, and Freekeh Soup)",
    "instructions": "Place freekeh in a small bowl and cover with cold water. Set aside.\r\n\r\nCombine lamb, onion, black pepper, paprika, cinnamon, and salt in a pot. Stir in oil, 1/2 the cilantro, 1/2 the mint, and celery stalk until combined. Simmer over low heat for 15 minutes. Stir in chickpeas; pour in just enough water to cover, and return to a simmer. Stir in zucchini, carrot, and tomato paste.\r\n\r\nSet a steamer over the pot; add tomatoes. Cover and steam tomatoes until soft, about 5 minutes. Crush tomatoes using a wooden spoon, so pulp drips into soup. Remove the steamer and discard leftover tomato peels.\r\n\r\nAdd potato to soup and just enough water to cover. Simmer until potato is soft, about 10 minutes.\r\n\r\nDrain freekeh and add to soup. Simmer until soft, about 15 minutes. Remove celery stalk and discard. Sprinkle soup with remaining 1/2 cilantro and remaining 1/2 mint before serving.",
    "description": "Lamb · Algerian",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/p9tebp1764118792.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Freekeh",
        "quantity": "1 cup"
      },
      {
        "item": "Lamb",
        "quantity": "12 ounces"
      },
      {
        "item": "Onion",
        "quantity": "1 finely chopped"
      },
      {
        "item": "Black Pepper",
        "quantity": "1 tsp"
      },
      {
        "item": "Paprika",
        "quantity": "1 tsp"
      },
      {
        "item": "Ground Cinnamon",
        "quantity": "1 tsp"
      },
      {
        "item": "Salt",
        "quantity": "To taste"
      },
      {
        "item": "Vegetable Oil",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Cilantro",
        "quantity": "1  bunch"
      },
      {
        "item": "Mint",
        "quantity": "1  bunch"
      },
      {
        "item": "Celery",
        "quantity": "1"
      },
      {
        "item": "Chickpeas",
        "quantity": "14 oz jar"
      },
      {
        "item": "Water",
        "quantity": "4 cups"
      },
      {
        "item": "Zucchini",
        "quantity": "1 Diced"
      },
      {
        "item": "Carrots",
        "quantity": "1 Diced"
      },
      {
        "item": "Tomato Puree",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Tomato",
        "quantity": "3 Medium"
      },
      {
        "item": "Potatoes",
        "quantity": "1 Diced"
      }
    ]
  },
  {
    "name": "Fårikål (Norwegian National Dish)",
    "instructions": "▢\r\nCut the lamb into large pieces.\r\n▢\r\nSlice the cabbage into large wedges, keeping the core attached.\r\n▢\r\nAdd a layer of lamb pieces to the bottom of a large pot, fatty side down. Sprinkle with peppercorns and salt. Add a layer of cabbage wedges on top. Repeat with more layers of lamb, peppercorns, and cabbage, ending with cabbage on top.\r\n▢\r\nOptional: Sprinkle a couple of tablespoons on top of the lamb for a thicker stew.\r\n▢\r\nAdd water to the pot and bring to a boil. Cover and reduce heat. Cook on low heat for 2 – 3 hours, until the lamb gently falls away from the bone.\r\n▢\r\nServe with boiled potatoes and fresh parsley, covering generously with the fårikål broth.",
    "description": "Lamb · Norwegian",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/ttfxxn1762773067.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Lamb",
        "quantity": "3 Lbs"
      },
      {
        "item": "White Cabbage",
        "quantity": "1 head"
      },
      {
        "item": "Whole black peppercorns",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Salt",
        "quantity": "3 tsp"
      },
      {
        "item": "Water",
        "quantity": "1 1/2 cups"
      },
      {
        "item": "Flour",
        "quantity": "5 tablespoons"
      }
    ]
  },
  {
    "name": "Hot cumin lamb wrap with crunchy slaw & spicy mayo",
    "instructions": "step 1\r\nHeat a griddle pan. Rub the lamb steaks with the oil, cumin and some seasoning. Griddle for about 3-4 mins on each side or until cooked to your liking. Place to one side on a plate to rest.\r\n\r\nstep 2\r\nIn a large bowl, stir the sugar into the vinegar until dissolved. Add the carrots, spring onions, cabbage and some seasoning, and toss together.\r\n\r\nstep 3\r\nBlitz the whole peppers and the mayo in a food processor. Add a heap of the salad to each flatbread. Slice the lamb, trimming off any excess fat and lay on top of the salad, drizzling with the resting juices. Spoon over the mayo and scatter with a few of the sliced peppers. Roll up and eat. If using pitta, split and stuff. Serve any extra salad on the side.",
    "description": "Lamb · Turkish",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/jyylmo1763790808.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Lamb Leg",
        "quantity": "4 small"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tsp"
      },
      {
        "item": "Ground Cumin",
        "quantity": "1 tsp"
      },
      {
        "item": "Sugar",
        "quantity": "1 tablespoon"
      },
      {
        "item": "White Wine Vinegar",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Carrots",
        "quantity": "2"
      },
      {
        "item": "Spring Onions",
        "quantity": "2 sliced"
      },
      {
        "item": "White Cabbage",
        "quantity": "400g"
      },
      {
        "item": "Sweet Peppadew Peppers",
        "quantity": "5"
      },
      {
        "item": "Mayonnaise",
        "quantity": "3  tablespoons"
      },
      {
        "item": "Pita Bread",
        "quantity": "4 large"
      }
    ]
  },
  {
    "name": "Imam bayildi with BBQ lamb & tzatziki",
    "instructions": "step 1\r\nHeat oven to 190C/170C fan/gas 5. Halve the aubergines lengthways and score the flesh side deeply, brush with a good layer of olive oil and put on a baking sheet. Roast for 20 mins or until the flesh is soft enough to scoop out.\r\n\r\nstep 2\r\nFry the onion in a little oil until soft, add the garlic and cinnamon and fry for 1 min. Once the aubergines are cool enough to handle, scoop out the centres. Roughly chop the flesh and add it to the onions. Halve the tomatoes, scoop the seeds and juice into a sieve set over a bowl, then chop the flesh. Add the chopped tomatoes to the pan and cook everything for 10 mins until nice and soft. Add a little more oil if you need to. Stir in the parsley, leaving a little for scattering at the end.\r\n\r\nstep 3\r\nLay the aubergine halves in a baking dish and divide the tomato mixture between them. Pour over the juice from the tomatoes, drizzle with more olive oil and bake for 30 mins until the aubergines have collapsed.\r\n\r\nstep 4\r\nMeanwhile, mix the tzatziki ingredients together and put in a small serving bowl.\r\n\r\nstep 5\r\nSeason the lamb with salt, black pepper and a pinch of paprika. Griddle, grill or barbecue for 3 mins on each side or until the fat is nicely browned, then put in a serving dish and squeeze over the lemon halves. Scatter the aubergines with parsley, then serve with the lamb and tzatziki.",
    "description": "Lamb · Turkish",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/ampz9v1763787134.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Aubergine",
        "quantity": "3"
      },
      {
        "item": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Onion",
        "quantity": "1 chopped"
      },
      {
        "item": "Garlic",
        "quantity": "2 cloves chopped"
      },
      {
        "item": "Cinnamon",
        "quantity": "1 tsp"
      },
      {
        "item": "Tomato",
        "quantity": "8"
      },
      {
        "item": "Parsley",
        "quantity": "Bunch"
      },
      {
        "item": "Lamb Loin Chops",
        "quantity": "12"
      },
      {
        "item": "Paprika",
        "quantity": "Pinch"
      },
      {
        "item": "Lemon",
        "quantity": "1"
      },
      {
        "item": "Greek Yogurt",
        "quantity": "150g"
      },
      {
        "item": "Cucumber",
        "quantity": "1/2"
      },
      {
        "item": "Mint",
        "quantity": "2 tbs chopped"
      }
    ]
  },
  {
    "name": "Kapsalon",
    "instructions": "Cut the meat into strips. Heat oil in a pan and fry the strips for 6 minutes until it's ready.\r\nBake the fries until golden brown in a deep fryrer. When ready transfer to a backing dish. Make sure the fries are spread over the whole dish.\r\nCover the fries with a new layer of meat and spread evenly.\r\nAdd a layer of cheese over the meat. You can also use grated cheese. When done put in the oven for a few minutes until the cheese is melted.\r\nChop the lettuce, tomato and cucumber in small pieces and mix together. for a basic salad. As extra you can add olives jalapenos and a red union.\r\nDived the salad over the dish and Serve with garlicsauce and hot sauce",
    "description": "Lamb · Dutch",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/sxysrt1468240488.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Fries",
        "quantity": "250 Grams"
      },
      {
        "item": "Doner Meat",
        "quantity": "500 Grams"
      },
      {
        "item": "Garlic sauce",
        "quantity": "Topping"
      },
      {
        "item": "Hotsauce",
        "quantity": "Topping"
      },
      {
        "item": "Lettuce",
        "quantity": "1 Bulb"
      },
      {
        "item": "Tomato",
        "quantity": "1"
      },
      {
        "item": "Cucumber",
        "quantity": "3rd"
      },
      {
        "item": "Gouda cheese",
        "quantity": "100 Grams"
      }
    ]
  },
  {
    "name": "Keleya Zaara",
    "instructions": "Heat the vegetable oil in a large frying pan over medium-high heat. Add the lamb and cook until browned on all sides, about 5 minutes. Season with saffron, salt and pepper to taste; stir in all but 4 tablespoons of the onion, and pour in the water. Bring to the boil, then cover, reduce heat to medium-low, and simmer until the lamb is tender, about 15 minutes.\r\nUncover the pan, stir in the butter and allow the sauce reduce 5 to 10 minutes to desired consistency. Season to taste with salt and pepper, then pour into a serving dish. Sprinkle with the remaining chopped onions and parsley. Garnish with lemon wedges to serve.\r\n",
    "description": "Lamb · Tunisian",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/8x09hy1560460923.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "4 tbs"
      },
      {
        "item": "Lamb",
        "quantity": "750g"
      },
      {
        "item": "Saffron",
        "quantity": "1 1/2 tsp"
      },
      {
        "item": "Onion",
        "quantity": "1 Large Chopped"
      },
      {
        "item": "Water",
        "quantity": "25 ml"
      },
      {
        "item": "Parsley",
        "quantity": "30g"
      },
      {
        "item": "Butter",
        "quantity": "1 tbs"
      },
      {
        "item": "Lemon",
        "quantity": "1"
      }
    ]
  },
  {
    "name": "kofta burgers",
    "instructions": "step 1\r\nTip the mince into a large bowl (use a clean washing-up bowl if you don’t have anything big enough) with all the other burger ingredients and a good pinch of salt. Roll up your sleeves, get your hands into the mix and squelch everything together through your fingers until completely mixed. Pat the mix into 16 small burgers. These may now be frozen for up to 1 month or chilled up to a day ahead.\r\n\r\nstep 2\r\nTo cook, heat grill to its highest setting and lay the burgers in a single layer on a baking tray (you may need to do this in batches, depending on how big your tray is). Grill on the highest shelf for 5-6 mins on each side until browned and cooked through. Pile burgers onto a platter and serve with all the accompaniments, so everyone can construct their own sandwich.",
    "description": "Lamb · Turkish",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/lgmnff1763789847.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Lamb",
        "quantity": "1kg"
      },
      {
        "item": "Onion",
        "quantity": "2"
      },
      {
        "item": "Garlic Bulb",
        "quantity": "1"
      },
      {
        "item": "Garam Masala",
        "quantity": "6 tablespoons"
      },
      {
        "item": "Coriander",
        "quantity": "Bunch"
      },
      {
        "item": "Chilli Sauce",
        "quantity": "1 tablespoon"
      },
      {
        "item": "Pita Bread",
        "quantity": "8"
      },
      {
        "item": "Tomato",
        "quantity": "4 sliced"
      },
      {
        "item": "Red Cabbage",
        "quantity": "1/2"
      },
      {
        "item": "Red Onions",
        "quantity": "1 sliced"
      },
      {
        "item": "Yogurt",
        "quantity": "Small pack"
      }
    ]
  },
  {
    "name": "Lamb & apricot meatballs",
    "instructions": "step 1\r\nHeat 2 tsp oil in a pan and soften the onions for 5 mins. Add the garlic and spices and cook for a few mins more. Spoon half the onion mixture into a bowl and set aside to cool. Add the tomatoes, sugar and seasoning to the remaining onions in the pan and simmer for about 10 mins until reduced.\r\n\r\nstep 2\r\nMeanwhile, add the mint, lamb, apricots and breadcrumbs to the cooled onions, season and mix well with your hands. Shape into little meatballs.\r\n\r\nstep 3\r\nHeat the rest of the oil in a non-stick pan and fry the meatballs until golden (in batches if you need to). Stir in the sauce with a splash of water and gently cook everything for a few mins until the meatballs are cooked through. Serve with pitta bread and salad.",
    "description": "Lamb · Turkish",
    "category": "Lamb",
    "image_url": "https://www.themealdb.com/images/media/meals/72fgzj1764109947.jpg",
    "difficulty": "medium",
    "servings": 4,
    "ingredients": [
      {
        "item": "Olive Oil",
        "quantity": "2 tablespoons"
      },
      {
        "item": "Red Onions",
        "quantity": "2 chopped"
      },
      {
        "item": "Garlic",
        "quantity": "4 Cloves Crushed"
      },
      {
        "item": "Ground Cumin",
        "quantity": "2 tsp"
      },
      {
        "item": "Ground Coriander",
        "quantity": "2 tsp"
      },
      {
        "item": "Tinned Tomatos",
        "quantity": "400g"
      },
      {
        "item": "Sugar",
        "quantity": "1/2 teaspoon"
      },
      {
        "item": "Mint",
        "quantity": "10g"
      },
      {
        "item": "Lamb Mince",
        "quantity": "500g"
      },
      {
        "item": "Dried Apricots",
        "quantity": "8"
      },
      {
        "item": "Breadcrumbs",
        "quantity": "50g"
      },
      {
        "item": "Pita Bread",
        "quantity": "To serve"
      }
    ]
  }
]